{
  "base_layers": [{
    "title": "Zucchini and Corn Filling",
    "description": "",
    "ingredients": ["Diced zucchini", "White or yellow corn kernels", "Chopped white onion", "Chopped tomatoes", "Finely chopped garlic", "Black beans (you can even use )", "Finely chopped oregano or Epazote"],
    "directions": ["Toast corn in a skillet over high heat with oil and salt for about 5 minutes. Remove corn.", "Cook onion in the skillet until it caramelizes (about 5 minutes). Leave onion in there.", "Add garlic, cook another 1 or 2 minutes.", "Add diced tomatoes, cook for 8-10 minutes.", "Add zucchini, cook until it's tender.", "Add corn back in.", "Add black beans, Epazote; add salt, pepper, and other seasonings to taste. Cook for 3-4 more minutes."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Nov 3 21:23:04 2013 +0000",
    "author": "Noah <noah@noahveltman.com>"
  }, {
    "title": "Delengua (Beef Tongue)",
    "description": "Entertaining? Wanna go exotic? Got a little bit of time? Makes in the neighborhood of 20 tacos.",
    "ingredients": ["1 1/2 pounds of cow tongue", "1/2 onion", "2 bay leaves", "1 quart chicken stock", "6 cilantro stems", "1 small carrot, peeled and roughly chopped", "2 cloves garlic", "2 tablespoons Canola Oil"],
    "directions": ["Combine tongue, onion, bay leaves, carrot, and garlic in a saucepan.", "Add stock until mostly covered.", "Bring to a boil over high heat, reduce to a simmer, cover with lid, and cook four to six hours until completely tender (depends on the size of the tongue).", "Add water as necessary to keep the tongue mostly submerged.", "Move tongue to a cutting board.", "Strain stock and chuck the solids, keeping the liquid for later.", "Peel the outer membrane off the tongue and discard. Chop tongue into 1/2-inch pieces.", "When ready to serve, heat oil in a large non-stick skillet set over medium-high heat until shimmering. Add tongue and cook, stirring occasionally, until tongue is well browned on all sides, 5 to 8 minutes total."],
    "notes": ["The first seven steps can be done well in advance. Should keep in fridge up to five days."],
    "tags": [],
    "created": "Sat Nov 2 23:20:01 2013 -0500",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "Swiss Chard",
    "description": "This is actually a Rick Bayless recipe from his cookbook Mexican Everyday, but we've used it a fair amount on those days we feel like not eating meat but still want to have tacos.",
    "ingredients": ["1 bunch swiss or rainbow chard. Could also do spinach I guess. Probably not good with kale.", "1 onion sliced thin", "1/2 cup of chicken or vegetable broth"],
    "directions": ["Slice up the chard into small slices.", "In a large skillet, heat the oil on medium-high. Cook the onions until soft, plus some garlic and red pepper flakes if you want.", "Put the chard in the skillet, add the broth.", "Cover the pan and reduce the heat to medium-low and cook until the greens are wilted and almost tender (about 5 minutes).", "Uncover, bring heat back to medium high and cook until almost dry. Salt as necessary. Enjoy."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Sun Nov 3 07:12:31 2013 -0500",
    "author": "Jacob Harris <jharris@nytimes.com>"
  }, {
    "title": "Spaghetti Squash",
    "description": "",
    "ingredients": ["1 Spaghetti Squash"],
    "directions": [],
    "notes": [],
    "tags": ["vegan", "vegetarian"],
    "created": "Tue Oct 7 20:49:25 2014 -0500",
    "author": "Geoff Hing <geoffhing@gmail.com>"
  }, {
    "title": "Soyrizo",
    "description": "",
    "ingredients": ["Soyrizo (The El Burrito branded 'SoyRizo' is by far the best vegan option out there)", "chopped potatoes", "green peppers"],
    "directions": ["Throw some Soyrizo in a sauce pan with chopped potatoes and green peppers and brown for added bonus."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Nov 3 13:13:29 2013 -0600",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "@deezthugs' Smokey Turkey Tacos",
    "description": "These tacos have and will blow minds.\n\n(Note:  I cannot separate the base_layer here from the seasoning, it is all integral)",
    "ingredients": ["2 Packages ground Turkey or Chicken (1.5 to 2 lbs) - not the lean stuff for Chrissake!", "Several slices of cooked bacon, diced", "2 Tbs Coconut oil", "2 Tbs Bacon Grease. That's right, Bacon Grease. (What you don't keep it? Might as well just quit now)", "1 Medium sweet onion", "(The following dry ingredients can be increased depending on amount of meat)", "4 Garlic Cloves, smashed", "1 tsp Cumin", "2 tsp Onion powder", "1 tsp Chipotle powder (use as much as required)", "1 tsp (cool smokey) Paprika", "1 tsp Cinnamon", "1 tsp Ground Ginger", "1/2 - 1 tsp Black Pepper", "1 tsp Kosher Salt", "3 Limes, juiced", "[optional] 1/2 can low-salt Chicken broth"],
    "directions": ["Combine all dry seasonings in bag, shake up and combine well with raw turkey meat. return to fridge for an hour or more.", "Melt the Bacon Grease over medium heat, add Coconut oil and diced onion, cook down till onions are, well, you know, awesome. Add the smashed garlic. Add the bacon. Add the turkey meat and break it down into medium/small bits with a spatula or butter knife. After cooking for a few minutes and the meat has begun to brown, drizzle 2 of limes' juice onto the meat.", "Cook well, adding optional chicken broth to shape the consistency as needed. (Generally not needed unless you accidentally buy low-fat meat. Shame on you.)", "Finally, transfer amount for a meal to a frying pan, frying for a few minutes to create some crispy bits (This is the key step:)), adding lime juice as it cooks.  Spoon onto favorite tortillas add condiments and devour."],
    "notes": [],
    "tags": [],
    "created": "Wed Nov 13 11:49:38 2013 -0600",
    "author": "David Dahl <ddahl@nulltxt.se>"
  }, {
    "title": "Slow-Cooked Salsa Verde Chicken",
    "description": "Low-effort, delicious shredded chicken based off this recipe. To minimize prep time, just toss in a jar of storebought salsa verde.",
    "ingredients": ["2 lbs skinless chicken breasts", "2 cups salsa verde", "1 tsp minced garlic or 1/4 tsp garlic powder", "Pinch of Oregano", "Pinch of Cumin", "Salt, to taste"],
    "directions": ["Add chicken to slow cooker and season with garlic, oregano, cumin and salt. Pour salsa verde over everything, cover and cook for two hours on high.", "Once that's ready, shred chicken. Give it another stir to cover everything in sauce, then serve."],
    "notes": [],
    "tags": [],
    "created": "Sat Nov 2 21:41:46 2013 -0400",
    "author": "katiepark <katie.e.park@gmail.com>"
  }, {
    "title": "Seasoned Lentils",
    "description": "This is a quick and easy vegetarian substitute for ground beef that adds an interesting texture and a lot of similar flavor",
    "ingredients": ["1 packet of Taco Seasoning Mix", "1 bag of lentils", "1 tbs vegetable oil", "1/2 small onion, diced", "1 small tomato, diced"],
    "directions": ["Cook lentils according to package directions (generally just boiling in water). Set aside.", "In a skillet sauté onion and tomato in vegetable oil for a few minutes", "Stir in seasoning mix, amount of water specified on mix packet and cooked lentils.", "Follow directions on seasoning packet.", "Enjoy!"],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Mon Dec 9 09:01:41 2013 -0500",
    "author": "Todd Budnikas <toddb@missiondata.com>"
  }, {
    "title": "Red Cabbage Filling",
    "description": "",
    "ingredients": ["1/2 head of red cabbage, shredded", "3 chopped green onions", "1/2 bunch of finely chopped cilantro", "2-3 squeezed limes"],
    "directions": ["Mix all ingredients in large bowl"],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Nov 3 21:11:09 2013 -0500",
    "author": "Josh Williams <josh.williams@nytimes.com>"
  }, {
    "title": "Taco de rajas poblanas",
    "description": "",
    "ingredients": ["Bunch of poblano peppers", "Onion", "Tad of oil", "Mexican crema or sour cream", ", fresh corn", ", queso Oaxaca or panela or fresco"],
    "directions": ["Start with 1 or more produce-section bags of Poblano peppers,\nit's handy if the bags are not totally full for a subsequent step.", "Place the Poblano peppers over an open flame, typically directly\nover a natural gas burner on a stove. Their skin will bubble and blister,\nrotate and rearrange them with tongs until the burns, bubbles, and\nblisters are evenly distributed around the chiles and you feel a tingle\nin your upper sinuses. Put the singed peppers back in the produce bags,\nthen close the bags tightly to 'sweat' the chiles inside.", "While the chiles are sweating, sautee some onion slices in a pan.\nOptionally, add some pre-cooked whole kernels of corn when the onion is\nalmost done.", "Take the chiles out of the bag. Their skin will be wilted and will come off\nin your fingers. Peel the outer layer of the chiles off and discard. Once\nthe outer skin is removed, de-vein the rest and remove the seeds. Then\ncut the flesh into thinninsh strips.", "Add the chile strips (the 'rajas') back into the pan with the onion. Get it\nall hot and finish cooking any bits of chile that remain raw after the\nskin removal process. When it looks close to done, lower the cooking heat\nto a minimum and add the cream and cheese(s) and warm them for about 5 minutes."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Sun Nov 3 00:02:15 2013 -0700",
    "author": "Brian Mount <bvmount@gmail.com>"
  }, {
    "title": "Pork Shoulder with Chile and Onions",
    "description": "This is  my attempt to re-create my most favorite al pastor in Oakland -- the stuff they make at Tacos Sinaloa in Fruitvale. Saucy, packed with sauteed onions -- it's amazing stuff. This isn't a match, but it's damn fine, and close. I like it with roasted tomatillo salsa and crema  and a Dos Equis amber.",
    "ingredients": ["Some number of pounds of pork shoulder. Get the good stuff; the pork will taste of its fat, and cheap pork fat tastes gross. A pound of pork shoulder makes dinner for 3-4 people, depending on just how many tacos each of you can put down.", {
      "title": "Per pound of pork:",
      "ingredients": ["1 medium onions (can do two large onions per three pounds pork). I like yellows, but I've done sweet onions and it's rad.", "A pile of chiles.", "Salt"]
    }, {
      "title": "chiles",
      "ingredients": ["Let's pause here for a second, 'cause there are a  of great chiles you could use. I think this is best with dried red chiles, and ambrosial if those chiles were smoked. That means chipotles, anchos, or Oaxacenos. It's difficult to give quantities on these things. It comes down to taste, hey? If you don't cook with these things often, or don't like spicy foods, use Oaxacenos -- one or even a half of one per pound. If you like it hot, keep adding chipotles until your head explodes. I like spicy pork; I typically use two chiplotles per pound, depending on chili size. If you aren't big on smoked chiles, look at a dried New Mexico red, or use fresh-ground ."]
    }, "1 cloves garlic, peeled", "Salt"],
    "directions": ["Set the oven to 350 degrees. Put a Dutch Oven on the range and apply medium heat.", "Chop up your pile of onions. Mince up the garlic. Heck -- get a beer. This is good beer-drinking-cooking. And the chiles! Chop them up too. That'll get you going.*", "Oh yeah -- cut your pork shoulder into hunks of roughly equal size. I try to keep the hunks as big as possible. Coat it all over with salt.", "So. Here's the basic idea: we're going to roast a pork shoulder. We don't want it to get dried out; we also don't want to add liquid to it. The moisture will come from the onions, which we also want to caramelize. What we're going to do is this: start with a base of cooked onions; start roasting the pork shoulder; add onions to keep it moist, but not too many or too fast so that they can get dry enough to caramelize. You can work the lid, here -- add it if things are drying out too quickly, remove if things are staying too wet.", "Add a tablespoon or so of the oil of your choice to the Dutch Oven (I use bacon fat). Once it's hot, toss in 1/2-1/3 of your chopped onion. Cook the onion until it turns translucent; add about half the chopped chiles and garlic, stir well, then add the pork shoulder. Start them fat-side down, and try to get the fat in contact with the dutch oven.", "Pop the whole works in the oven, uncovered (to start). Grab your beer, and maybe a book. Time to do some structured waiting.", "Every thirty minutes or so, check the pork shoulder. Check the stuff in the bottom of the pan; as it starts to dry out, throw in more onions and stir it all around. You can flip the hunks over after a while -- use tongs.", "The pork shoulder is done when it is tender but not soft. You should be able to separate the hunks with a pair of forks, but you should not be able to cut it with a fork. Honestly, I like mine a touch on the chewy side -- well roasted and cooked through but not actually falling apart. (Try this: slice off a little hunk of pork. Is it delicious? Just a little chew? It's done! If it's tough, keep going.) For a three pound pork shoulder in my oven, this takes about two hours.", "When the pork shoulder is done, pull the hunks out of the pot with tongs, transferring them to a cutting board. Transfer the Dutch Oven back to the range and set medium heat.", "Chop the pork hunks into bits.", "Toss whatever onion and chile and garlic you have left into the Dutch Oven to cook in the rendered fat and onion goop. If things are stuck or cooked to the pan, pour in a bit of your beer to loosen it. Do you like flavors other than what's already there? Oregano or cumin? This is where I'd add those, m'self, but I don't usually want 'em.", "Once the onion in the pot is tender, toss the pork back in and stir liberally.", "Hey, you're done! It's ready to go in tacos! I love this as a simple taco: hot corn tortillas, this stuff, roasted tomatillo salsa, a little crema, but it would win your heart with seared corn and epazote and maybe some cotija. You should eat as you like!"],
    "notes": ["Have you handled very hot peppers before? No? Okay, listen, this is really important: hot chiles will get oil on your fingers, and it will burn any sensitive body parts you touch. That oil is very difficult to scrub off, so just washing your hands isn't enough. Dried chiles are much safer to work than fresh or freshly roasted chiles, but you can still have an awfully rough evening of pouring salene solution in your eyes if you aren't careful. When in doubt: nitrile gloves."],
    "tags": [],
    "created": "Sun Nov 17 23:05:23 2013 -0800",
    "author": "Ross Donaldson <gastove@gmail.com>"
  }, {
    "title": "Puerco Pibil",
    "description": "A delicious, slow roasted Pork dish from the Yucatan. Can be served over rice or used as a base layer in tacos!",
    "ingredients": ["5 lbs Pork Butt", "Banana Leaves", {
      "title": "Spices",
      "ingredients": ["5 Tbsp whole Annato seeds", "2 Tsp whole Cumin seeds", "1 Tbsp Peppercorns", "8 whole Allspice seeds", "1/2 Tsp whole cloves"]
    }, "2 chopped Habenero Chiles, stems and seeds removed.", "1/2 Cup Orange Juice", "1/2 Cup white vinegar", "2 Tbsp salt", "The juice of 5 lemons", "1-2 shots of your favorite Tequila"],
    "directions": ["Grind the spices in a coffee grinder. Don't use your usual coffee grinder. Use a grinder that you use specifically for spices only.", "Add the chiles, oj, vinegar, salt, lemon juice, tequila, and spice mix to a blender and blend well.", "Cut the pork into 2 inch cubes and place in a large zip lock bag.", "Preheat oven to 325 degrees (if you haven't yet).", "Pour the blended mixture into the bag and seal. Be sure to coat all of the meat with the mixture.", "Line a 9 x 13 inch pan with Banana leaves.", "Pour entire contents of the zip lock bag into the pan.", "Cover with more Banana leaves.", "Cover entire pan tightly with aluminum foil.", "Put the pan in the oven and relax for the next 4 hours.", {
      "title": "",
      "directions": ["Enojoy!"]
    }],
    "notes": [],
    "tags": [],
    "created": "Wed Jan 15 12:07:20 2014 -0500",
    "author": "Nathan Arnold <nathan@shorepound.net>"
  }, {
    "title": "Braised Pork Belly",
    "description": "Pork belly can be intimidating, but the reward is melt-in-your-mouth deliciousness! The crispy pork belly, creamy avocado, and crunchy onions are a perfect blend of textures in this taco. DO try this at home :)\n\nPork belly recipe adapted from Mario Batali",
    "ingredients": [{
      "title": "Rub",
      "ingredients": ["1/4 cup Brown Sugar", "1 tablespoon Fennel (toasted and ground)", "2 tablespoons Salt", "3 sprigs of Rosemary (finely chopped)", "1 tablespoon crushed Red Pepper Flakes"]
    }, {
      "title": "Braise",
      "ingredients": ["1 pound of skinless Pork Belly", "1 Carrot (peeled)", "2 stalks of Celery", "1/2 Red Onion", "1 Fennel Stalk", "1 tablespoon Fennel Seeds", "1 bottle Beer", "Extra Virgin Olive Oil"]
    }],
    "directions": ["Preheat oven to 350 F", "Combine rub ingredients", "Without slicing the pork belly the whole way through, score the fat of the pork belly in a 1-inch grid pattern", "Massage the rub into pork belly", "Chop vegetables into 1/2 inch pieces", "Heat a large dutch oven over medium high-heat with a few tablespoons of olive oil", "Sear the pork, fat side down, until golden brown and crispy", "Flip pork and add the carrots, celery, red onion, fennel, fennel seeds, beer and season with salt", "Bring to a boil", "Transfer meat to the preheated oven and cook, uncovered, for 1.5 to 2 hours", "Once the pork belly has finished cooking, slice into 1/4 inch thick slabs - use 2 slices per taco, or more if desired", "Add green tomatillo salsa, fresh avocado, and onions and cilantro to garnish", "Best in corn tortillas, but flour or wheat tortillas are also acceptable"],
    "notes": [],
    "tags": [],
    "created": "Sat Oct 31 16:27:10 2015 -0500",
    "author": "Sarah Fulgham <safulgham@gmail.com>"
  }, {
    "title": "Pepper Tempeh",
    "description": "",
    "ingredients": ["1 block tempeh", "1 T olive oil", "1 T apple cider vinegar", "1/2 T soy sauce or Braggs", "1 t garlic powder", "1/2 C water", "Ample amounts of coarsely ground black pepper to taste"],
    "directions": ["Cut tempeh into thin slices", "Combine olive oil, vinegar, soy sauce, garlic powder and water in a bowl and marinate the Tempeh for 10-30 minutes.", "Add the tempeh and marinade to a skillet and saute over medium heat until liquid evaporates.", "Add a bit more water and continue to cook for about 2 minutes."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Jul 26 12:32:03 2014 -0500",
    "author": "Geoffrey Hing <geoff@terrorware.com>"
  }, {
    "title": "Pan-seared salmon",
    "description": "",
    "ingredients": ["1½ pounds (680g) fresh salmon filet", "Salt", "Pepper", "Butter/ghee/vegetable oil"],
    "directions": ["Cut the salmon into 1x1 inch cubes (or any size that you think is a good mouthful).", "Pat the cubes dry and season with salt and pepper.", "Heat about a tablespoon of butter/ghee/vegetable oil in a skillet over medium-high heat. Add the salmon and turn heat to medium-low.", "Fry the salmon until cooked through, about 4 minutes depending on the size."],
    "notes": [],
    "tags": [],
    "created": "Wed Oct 5 20:53:06 2016 +0200",
    "author": "Madeleine Schönemann <madeleine.schonemann@tretton37.com>"
  }, {
    "title": "Onion",
    "description": "",
    "ingredients": ["Onion", "Olive oil (optional)"],
    "directions": [],
    "notes": [],
    "tags": [],
    "created": "Sat Jul 12 23:40:03 2014 -0700",
    "author": "nick11robers <nick.roberts.127.0.0.1@gmail.com>"
  }, {
    "title": "Overly Seasoned Ground Beef",
    "description": "I enjoy tripling (or more) the generic store bought taco seasoning when rendering my ground beef.\n\nI've found that while with most cooking, you can in fact over season pretty easily, that's not the case with taco ground beef.\n\nI will aggressively season the beef, even adding additional cumin and garlic.\n\nThis basically seasons the entire taco, so you can spend less time prepping all of the toppings.",
    "ingredients": ["3x taco seasoning", "cumin", "garlic"],
    "directions": [],
    "notes": [],
    "tags": [],
    "created": "Sat Nov 2 23:20:01 2013 -0500",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "Slow Cooked No-Bean Chili",
    "description": "Super delicious and spicy no-bean chili made from scratch.",
    "ingredients": ["1 kg / 2.2 lbs chuck steak", "1 Garlic head", {
      "title": "Spice mix",
      "ingredients": ["2 tbsp Flour", "1 tbsp Chili powder", "2 tsp Cumin powder", "2 tsp Coriander powder", "1 tsp Dried oregano", "1 tbsp Brown sugar"]
    }, "Beer of your choice", "2 Jalapeños", "2 Dried ancho chili peppers", "2 Dried chipotle chili peppers", "1 Beef bouillon cube", "Oil, preferably corn oil", "A large cooking pot"],
    "directions": ["Remove the stems and the seeds from the dried peppers. Cover them with water in a small pot and boil for 15 minutes.", "Mix the peppers with the water until it transforms into a sort of chili sauce.", "Finely chop the garlic and jalapeños.", {
      "title": "Cut the beef in 2 cm cubes and sear them on high temperature in oil together with the garlic.",
      "directions": ["Protip: You'll get much better result if you don't sear all the beef at once."]
    }, "Sprinkle the spice mix over the beef.", "Lower the temperature and add the chili sauce we made in the beginning.", "Add enough beer that it covers everything and throw in the bouillon cube.", {
      "title": "Cover the cooking pot and let it simmer a couple of hours until the meat is all stringy and nice.",
      "directions": ["Protip: Crack a bottle of beer, sit back and relax as this will take a while.", "Protip: Lower temperature → longer cooking time → better result."]
    }, "Remove the cover and reduce the liquid until the texture is perfect™.", {
      "title": "Balance up the flavors with salt, black pepper and brown sugar.",
      "directions": ["Protip: A couple of dashes of soy sauce is nice if you're looking for a darker color."]
    }],
    "notes": [],
    "tags": [],
    "created": "Sat Apr 5 13:56:22 2014 +0200",
    "author": "Henric Englund <hnrcnglnd@gmail.com>"
  }, {
    "title": "Moroccan Lamb",
    "description": "A Differently Spiced Meat Than Your Usual Taco",
    "ingredients": ["500 g ground lamb", {
      "title": "20 g Ras al Hanout spice. My mix contains:",
      "ingredients": ["Paprika", "Cinnamon", "Allspice", "Clove", "Toasted Mustard", "Cumin", "Caraway", "Black Pepper"]
    }, "10 g fresh lemon zest or 10 g finely ground Black Lemon Omani (Moroccoan dried preserved lemon)"],
    "directions": ["Mix together and brown."],
    "notes": [],
    "tags": [],
    "created": "Thu Nov 7 13:53:17 2013 -0500",
    "author": "Tim Murtaugh <tim.murtaugh@ogilvy.com>"
  }, {
    "title": "Marinated Portobello Mushroom",
    "description": "Sometimes you're throwing a taco party and you need a vegetarian option. Sometimes you just don't feel like eating meat.",
    "ingredients": ["portobello mushrooms", "", "salt", "cracked black pepper"],
    "directions": ["Since a proper taco is never overstuffed, one decent-sized portobello should be enough for three servings. Multiply accordingly, and drop your mushrooms into a big Ziploc bag with enough  to cover. Let everything sit in your fridge for a couple of hours.", "Remove, season with just a touch of salt and cracked black pepper, then lay onto a grill (or a grill pan on your stovetop) over medium to medium-high heat for a few minutes on each side. Cut into thick slices, and you'll have a nice, earthy taco base."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Sat Nov 2 23:20:46 2013 -0700",
    "author": "Ryan Pitts <ryan.a.pitts@gmail.com>"
  }, {
    "title": "Insane Garlic Ground Turkey",
    "description": "While not particularly fancy, the insane garlic ground turkey is a crowd pleaser.\n\nTotal cooking time: 30-40 minutes",
    "ingredients": ["2 pounds of ground turkey (preferably thigh meat)", "Four yellow onions", "Store-bought Taco Seasoning", "More garlic than you can imagine (4-5 cloves)", "Olive Oil"],
    "directions": ["Chop several onions into slices.", "In a large pan heat olive oil in a saucepan over high heat", "Cook onions on high heat until they are almost caramelized. (10 minutes)", "Reduce heat to medium.", "Add ground turkey making sure to stir meat to ensure adequate turkey / onion mixture.", "Cover and let turkey cook for 8 minutes.", "Mix taco seasoning using one cup of water for each packet of seasoning", "Add several cloves or garlic to pan.  When in doubt with garlic always err on the side of too much.", "Cook uncovered until taco seasoning is reduced.", "Warn guests of impending garlic."],
    "notes": [],
    "tags": [],
    "created": "Tue Nov 5 15:18:04 2013 -0600",
    "author": "Tim O'Brien <tobrien@discursive.com>"
  }, {
    "title": "Ground Beef (Traditional; US)",
    "description": "The tranditional base for an American taco is ground beef, browsed in a skillet and seasoned.",
    "ingredients": ["1lb Ground Beef"],
    "directions": ["Heat a skillet on the stovetop.", "Brown the ground beef for 8-10 minutes, or until it is thoroughly cooked, stirring frequently to avoid sticking or burning. (If you're not using a non-stick pan, which is preferred, use 1T oil to keep things loose.)", "Stir in seasonings."],
    "notes": [],
    "tags": [],
    "created": "Wed Nov 6 18:06:21 2013 -0500",
    "author": "Tim Murtaugh <tim.murtaugh@ogilvy.com>"
  }, {
    "title": "Garlic Black Beans",
    "description": "",
    "ingredients": ["Can of plain black beans", "3 - 6 cloves of garlic chopped fine", "Vegetable oil of your choice", "Cumin", "Cayenne or Chipotle pepper (optional)", "Lemon juice (optional)"],
    "directions": ["Heat a tablespoon of olive oil in a saucepan over medium heat.", "When olive oil starts to shimmer, add the garlic and let it simmer for about 10 seconds.", "Add cumin and pepper (if wanted) and simmer for another 10 seconds.", "Pour in the entire can of beans, don't drain or rinse them.", "Simmer for about 15 minutes or until the bean broth has thickened to your liking. If the beans will be the main ingredient of your tacos, cook until the beans are just about totally dry. If you're using them in a mixture (like the  ), let the broth stay a little bit runny.", "Add a squeeze or two of lemon juice if you like."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Nov 3 11:46:51 2013 -0500",
    "author": "Marie Mosley <mariemosley@gmail.com>"
  }, {
    "title": "Fat-Poached Carnitas",
    "description": "",
    "ingredients": ["3 pounds of boneless pork shoulder or uncured picnic ham (see note for how to select).", "0.25 to 0.50 cups of liquified fat (oil, lard or duck fat is acceptable)", "10 to 15 garlic cloves (roasted preferred)", "1 lemon, sliced into thin circles and those are quartered", "coarse salt", "black pepper"],
    "directions": ["Heat oven to 250 degrees.", "Cube pork shoulder in roughly 3-inch chunks.", "Salt and pepper the cubes aggressively.", "Stuff cubes tightly (very tightly) into the smallest, deepest baking dish available.", "Stuff garlic and lemon between the cubes.", "Pour fat over cubes to just cover.", "Bake in oven for 5 hours.", "Remove dish from oven.", "Cover a sheet pan with foil.", "With slotted spoon, remove the pork to the sheet pan and spread out in a single layer.", "Turn on broiler.", "Broil pork in sheet pan until it is somewhat blackened and crispy, probably 4-6 minutes. YMMV because broilers are ridiculous.", "Remove from oven and tease with fork."],
    "notes": ["A nice thick fat cap on the top of the pork is preferable.", "Ask your butcher to remove any bones.", "Do not use cured meat."],
    "tags": [],
    "created": "Wed Jul 9 22:12:48 2014 -0400",
    "author": "Jeremy Bowers <jeremyjbowers@gmail.com>"
  }, {
    "title": "Crock Pot Pulled Pork",
    "description": "This is the base of my very favorite tacos. Added bonus is by cooking these all day in a slow cooker, your house smells amazing.\n\nNote: Unless you're cooking for a dozen people, you're going to end up with a lot of leftover pork, but that's about the best problem you can possibly have.\n\nGET GOING EARLY–in a perfect world, you're gonna give this thing at least eight hours on low.",
    "ingredients": ["2-3 pound hunk of pork shoulder.", "chili powder", "mexican oregano (dried)", "ground cumin", "medium-sized onion (or, a couple shallots)", "can of green chilies, diced", "pepper & salt"],
    "directions": ["Chop up your onion or shallot into small bits–you don't want big loops of onion, dice it.", "Rub your hunk of pork generously with chili powder, oregano, pepper, salt, and a pinch or two of cumin. I tend to try and have a very light crust of this stuff on the outside of the pork.", "Toss the hunk of pork, the onions, and the green chilis into the crock pot, set that sucker to LOW, and let it slow cook. I try to get mine in by 9am so I can eat around 6pm. If you're pressed for time, you can do this in about four hours on high, but the deliciousness factor is lowered.", "Once the time is up, either shred the thing up in the crock pot or, if you can actually get it out without it falling apart, get it into a bowl and shred from there. That way, you're getting it out of what ends up being a GIGANTIC AMOUNT of juices. But again: oh no, your pork ended up sitting in a big vat of juice–we all weep for you."],
    "notes": [],
    "tags": [],
    "created": "Sun Nov 3 12:32:23 2013 -0600",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "Crock Pot (Fake) Al Pastor",
    "description": "This isn't authentic al pastor (the real preparation is very similar to shawarma) but it's got the same flavors, and is super easy and crazy delicious.",
    "ingredients": ["1 medium bone-in pork shoulder (Boston butt), skin removed", "Kosher salt", "1 7oz can chipotle peppers in adobo", "2/3 of a pineapple, peeled, cored, and roughly chopped", "Fish sauce to taste (a few tablespoons)", "Kekap manis (Indonesian sweet soy sauce, available at most Asian supermarkets) to taste. Feel free to substitute regular soy sauce. About 1/4 cup", "One 14.5 oz can tomatoes, preferably fire roasted", "Cumin to taste, about 1 teaspoon"],
    "directions": ["Coat the shoulder generously with salt, and brown it well on all sides in a hot pan.", "Puree the peppers, adobo, pineapple, fish sauce, kekap manis, tomatoes, and cumin in a food processor or blender to a smooth puree. Taste and adjust seasoning.", "Pour half of the puree into a crock pot, and add the browned pork.", "Add a little liquid to the pan the pork cooked in (water, stock, beer, whatever's on hand) and scrape up all the good brown bits. Pour into the crock pot.", "Add the rest of the puree to the crock pot, then stick the whole thing in the fridge for at least an hour, or overnight.", "Cook the pork on the lowest setting for 10-12 hours, until it pulls apart very easily.", "Turn the crock pot to off, and leave the pork in the pot to cool for 30 minutes.", "Remove the pork to a platter or cookie sheet, and spoon off as much fat as possible from the top of the remaining liquid. Wick the last of the fat off with paper towels. If making  reserve 2 tablespoons of the fat.", "Remove the bones and chunks of fat from the pork, and add it back to the liquid in the crockpot. Shred with two forks, and rewarm if necessary."],
    "notes": [],
    "tags": [],
    "created": "Thu Mar 19 22:59:50 2015 -0400",
    "author": "bchartoff <bchartoff@gmail.com>"
  }, {
    "title": "Corn and Black Beans",
    "description": "Delicious hot as the main base_layer or as a supplement to others.\n\nThis is a fork of the Zuccini and Corn Filling because I'm not a Zuccini fan. I also tweaked the spices.",
    "ingredients": ["Fresh corn kernels, cut off the cob.", "1 can of Black Beans", "half a white onion", "salt", "chili powder", "cumin"],
    "directions": ["Toast corn in a skillet over high heat with oil and salt for about 5 minutes, or until browned. Remove corn.", "Cook onion in the skillet until it caramelizes (about 5 minutes). Leave onion in there.", "Add corn back in.", "Add black beans.", "Toss in a pinch of salt, a healthy couple shakes of chili powder, and a small pinch of cumin.", "Cook together for another 5 minute or so."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Mon Nov 11 16:38:39 2013 -0600",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "Chorizo",
    "description": "Perfect, lightly seasoned taco meat.\n\n_Adapted from Aredridel's Lightly Seasoned Beef_",
    "ingredients": ["20 oz chorizo", "20 g black cumin seed, ground", "2 cloves garlic", "15 ml white wine", "4 g salt if wine is unsalted", "1/2 small white onion, diced", "Oil to coat the pan"],
    "directions": ["Heat oil in the pan.", "Add in onions, stirring occasionally until onions become translucent.", "Toss in the garlic, and the chorizo on top of that.", "Add the cumin. Brown the chorizo.", "Use the splash of wine to loosen anything stuck to the pan."],
    "notes": [],
    "tags": [],
    "created": "Sat Nov 2 22:41:17 2013 -0500",
    "author": "Arelia <arelia.jones@gmail.com>"
  }, {
    "title": "Chopped Steak",
    "description": "I like all kinds of steak tacos, but lately have been into cubed up steak tacos that are allowed to marinate a little bit in some salsa verde and other spices. Here's the ones I made tonight.",
    "ingredients": ["1lb rib eye steak, cubed into ~1\" cubes", "Salsa verde, your choice, about 2-3 Tbs", "Pinch or two of mexican oregano", "A few healthy sprinkles of chili powder"],
    "directions": ["Cube up your steak, mix everything together, cover and let sit for a half hour or so.", "When everything else is ready to go, pan-fry (or, skewer and grill if you're feeling ambitious), until cooked to your chosen meat level."],
    "notes": [],
    "tags": [],
    "created": "Sat Nov 2 19:32:11 2013 -0500",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "Chopped Pork",
    "description": "This is a quick and easy way to prep and cook your pork for tacos.",
    "ingredients": ["pork chops, boneless, don't go too crazy thick, around 1-2\" tops.", "kitchen scissors"],
    "directions": ["Do you see where this is going? Cut up your chops unevenly with the scissors. Go for an average of chopped bits around 1\" in size or so, but variation is good, especially little bits. Those little bits are going to turn into crispy bits of goodness. When you..", "Prior to the pan-tossing, you should spice up your pork with a good rub or marinade. If you're looking, I recommend the .", "Toss all this into a high-heat pan (cast iron, if you've got it) and fry it up so that it chars up real nice. The little bits will turn into little charred chunks--this is a feature, not a bug."],
    "notes": [],
    "tags": [],
    "created": "Sat Mar 15 11:16:12 2014 -0500",
    "author": "sinker <dansinker@gmail.com>"
  }, {
    "title": "Chipotle Shrimp",
    "description": "",
    "ingredients": ["2 tablespoons unsalted butter", "1 lb shrimp, shelled & deveined", "1 batch"],
    "directions": ["In a bowl, add the shrimp and Chipotle Rub and stir to coat well.", "Heat a large non-stick skillet over medium-high heat and add the butter.", "When butter has melted, add the shrimp to the skillet. Cook for 1-2 minutes, and flip shrimp. Cook for 1-2 more minutes, or just until shrimp are pink. Remove shrimp from skillet."],
    "notes": [],
    "tags": [],
    "created": "Wed Jul 20 12:49:54 2016 -0700",
    "author": "Erin Morrissey <erinmorrissey@gmail.com>"
  }, {
    "title": "Carnitas",
    "description": "This recipe calls for both slow cooking the roast as well as frying before serving.",
    "ingredients": ["Pork shoulder roast", "Onion and Garlic powder", "Jalapenos", "Green Onions"],
    "directions": ["Place a pork shoulder roast in a crock pot, cover roast completely with water.", "Sprinkle onion & garlic powder into crock pot.", "Cook for 6 to 8 hours on high, or 8 to 10 hours on low.", "If frying at a later time, refrigerate roast with some of the cooking water.", "When ready to make tacos, shred the meat.", "Chop up as much jalapenos and green onions as desired.", "In a large frying pan add some oil. When the oil is hot but not burning add the meat and fry.", "Add some of the cooking water as needed to fry pan to keep the meat moist.", "In the last 5 or so minutes of cooking the meat, add the jalapenos and onions to meat.", "Meat should come out crispy but still moist", "Serve on tortillas (preferably soft corn tortillas) with choice of condiments (salsa, cheese, onions, etc)"],
    "notes": [],
    "tags": [],
    "created": "Mon Nov 4 19:41:52 2013 -0700",
    "author": "supersloth <joshua.rivera@gmail.com>"
  }, {
    "title": "Roasted Butternut Squash",
    "description": "The great thing about roasting butternut squash is that you just throw the whole squash into the oven, forget about it for about an hour, and the cooking is all self-contained - no prep (no need to chop up an uncooked gourd), no other ingredients and no messy dishes afterward.",
    "ingredients": ["Whole Butternut Squash", "Chili powder (optional)"],
    "directions": ["Roast a whole butternut squash in the oven at 400 degrees for 30 minutes to an hour until it is nice and soft.", "Cut open the squash, scoop out the seeds and discard the peel. Cut into bite-sized pieces and the squash is ready to go. No seasoning is necessary, but the sweet buttery flavor of the squash is pretty tasty with chili powder."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Mar 15 21:11:38 2014 -0400",
    "author": "Cassie McDaniel <cassie@mozillafoundation.org>"
  }, {
    "title": "Bulgar Black Bean Filling",
    "description": "This is a quick and easy vegetarian substitute for a ground beef-like texture without using a soy substitute.",
    "ingredients": ["1 cup cooked, strained bulgar", "1/3 cup cooked black beans (or canned), rinsed and strained."],
    "directions": ["Mix bulgar and black beans together. For better texture, slightly mash the black beans.", "Add your choice of seasonings to taste and serve."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Mon Nov 11 14:19:33 2013 -0500",
    "author": "Javaun Moradi <jmoradi@npr.org>"
  }, {
    "title": "Boiled Ground Beef",
    "description": "Boiling ground beef is a great way to to preserve flavor and delicious juiciness. This process requires a bit more time, but it's totally worth it.\n\n(Credit belongs to my wife, Jamie. See the full recipe here.)",
    "ingredients": ["2 pounds lean ground beef", "1 teaspoon salt", "1 teaspoon chili powder", "2 teaspoons cumin", "1 teaspoon garlic powder", "1 onion, minced", "enough water to completely cover the meat"],
    "directions": ["Place all ingredients in a large pan over high heat. Bring to boil. Turn down to medium/medium low heat and simmer for 1 hour. Use a potato masher to break apart the meat.", "Strain away any leftover liquid. If you are making this ahead of time you can place the leftover liquid in the fridge to harden the grease. Spoon off any hardened grease and add a little liquid back to the meat if you are reheating it."],
    "notes": [],
    "tags": [],
    "created": "Mon Nov 18 17:46:34 2013 -0600",
    "author": "Alex P. Gates <alex@whatcheer.com>"
  }, {
    "title": "Better Than Powder Ground Beef",
    "description": "Did you grow up on Old El Paso ground beef taco seasonings? I'm sorry.  So did I.  They're terrible, right?  Here's something better.",
    "ingredients": ["sautee half-onion", "salt", "pepper", "ground cumin"],
    "directions": ["Brown a pound of ground beef, seasoning liberally with ground cumin, salt, pepper. Add tabasco/other hot sauce if you like.", "When beef is browned, add a small jar of salsa (any kind!  i like corn/black bean tomato salsa), and simmer for 5-10 minutes.", "Enjoy.  Serve with crispy taco shells for nostalgia."],
    "notes": [],
    "tags": [],
    "created": "Tue Nov 5 21:41:21 2013 -0600",
    "author": "Jon Janego <jonjanego@gmail.com>"
  }, {
    "title": "Bell-pepper",
    "description": "",
    "ingredients": ["Bell-pepper"],
    "directions": ["A bell-pepper is typically cut up and then tossed into a skillet or something else to heat it. Olive oil is nice. They can be grilled as well."],
    "notes": [],
    "tags": [],
    "created": "Sat Jul 12 23:40:03 2014 -0700",
    "author": "nick11robers <nick.roberts.127.0.0.1@gmail.com>"
  }, {
    "title": "North Carolina Battered Catfish",
    "description": "Do it right and stick your arm down a catfish hole in the muddy waters of a north carolina pond, take that sucker home at serve it up to your friends and family on some corn tortilas",
    "ingredients": ["1 cup all-purpose flour", "1 cup cornmeal", "1 tablespoon baking powder", "1 tablespoon kosher salt", "1/2 teaspoon cayenne pepper", "1 (12-ounce) bottle amber beer", "4 (6-ounce) catfish fillets", "1 tablespoon salt", "1 tablespoon cracked black pepper", "2 tablespoons granulated garlic", "1 lemon, juiced"],
    "directions": ["Preheat a deep-fryer to 350 degrees Fahrenheit.", "In a large bowl, add the flour, cornmeal, baking powder, salt and cayenne and whisk to combine. Whisk in the beer, being sure to remove any lumps.", "Cut the catfish fillets in half lengthwise to make 2 strips. If desired, cut into bite-sized pieces. In a small bowl add the salt, pepper and granulated garlic. Season the fillets with the salt mixture.", "Dip each strip in the beer batter and add to the fryer, a few at a time, moving them around so they don't stick. Fry until brown and crispy, about 3 to 4 minutes. Remove from the fryer to a serving platter. Repeat with the remaining fillets and season the fish with lemon juice. Cut them up into taco size portions and show your friends how amazing your catch tastes."],
    "notes": [],
    "tags": [],
    "created": "Sat Nov 2 20:39:58 2013 -0500",
    "author": "cole <mcg42387@gmail.com>"
  }, {
    "title": "Basic Shredded Chicken",
    "description": "This recipe creates enough shredded chicken for 2 to 3 meals. It's a savory, universal base; once cooked, you can supplement with any number of spices or treatments to make tacos, taquitos, soups, enchiladas ... even Italian or Indian applications if you like.",
    "ingredients": ["4-5 lbs. boneless skinless chicken breast", "1 can chicken broth", "1 tsp chili powder", "1/2 tsp cumin", "1/2 tsp garlic powder", "1/2 tsp oregano", "kosher salt", "black pepper"],
    "directions": ["Salt the chicken breasts (be reasonably generous here), then crack some black pepper over each. In your crockpot, mix garlic powder, chili powder, cumin and oregano into the broth. Place chicken in crockpot, then cook on low for 8 hours.", "When the chicken is done, attack each piece with two forks to shred. Do this on a Sunday and you'll have an easy time putting together meals throughout the week.", "I often give this a quick simmer with a bit of water and  for taco filling. Or throw it into tortilla soup. Or make some sweet . Or just add some barbecue sauce to a handful of chicken, and toss it onto a soft roll for a quick sandwich. Man  live on tacos alone, but one doesn't have to."],
    "notes": [],
    "tags": [],
    "created": "Sun Nov 3 08:58:41 2013 -0800",
    "author": "Ryan Pitts <ryan.a.pitts@gmail.com>"
  }, {
    "title": "Baked Tilapia",
    "description": "Oven fried fish for when you think you want to pretend you're eating healthier.",
    "ingredients": ["1 pound mild fish (I usually use tilapia)", "1 cup masa", "2 tsp salt", "1/2 to 1 tsp cayenne", "2 tsp paprika", "2 tsps chili powder", "2 tsps garlic powder", "1/2 to 1 tsp black pepper (to taste)", "olive oil"],
    "directions": ["Preheat oven to 400 degrees.", "Mix dry ingredients in a bowl to make the coating for the fish.", "Cut fish into slices or chunks, as your taste desires.", "Drizzle olive oil over cut fish, and dip fish into breading.", "Bake for 8ish minutes and finish, if you can, under the broiler."],
    "notes": [],
    "tags": [],
    "created": "Sat Nov 2 22:01:46 2013 -0400",
    "author": "katemyers <kate.myers@gmail.com>"
  }, {
    "title": "Baja Beer Battered Fish",
    "description": "This is the beer battered fish for Baja fish tacos.",
    "ingredients": ["1/2 c flour", "1/4 c baking powder", "1 egg", "1/2 c beer (Tecate!)", "1 tsp salt", "1 tsp chili powder (paprika, salt, garlic salt)", "2 tsp parsley", "1 lb. cod fillet, grouper, or similar white fish, the fresher the better"],
    "directions": ["Batter", "Fish"],
    "notes": [],
    "tags": [],
    "created": "Mon Nov 4 10:16:58 2013 -0600",
    "author": "Kumar McMillan <kumar.mcmillan@gmail.com>"
  }, {
    "title": "Asian Style Tofu or Pork Marinade",
    "description": "",
    "ingredients": ["quarter cup lime juice", "quarter cup soy sauce", "quarter cup toasted sesame oil", "two cloves of garlic, chopped", "3 teaspoons cumin", "1 teaspoon paprika", "Some chopped cilantro"],
    "directions": ["Mix with sliced tofu or pork, marinate for 30 minutes and quickly sauté."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Sun Nov 3 11:58:34 2013 -0800",
    "author": "Karthik Ram <karthik.ram@gmail.com>"
  }, {
    "title": "Lightly Seasoned Beef",
    "description": "Perfect, lightly seasoned taco meat.",
    "ingredients": ["500 g ground beef or chopped steak", "20 g black cumin seed, ground", "2 cloves garlic", "15 ml white wine", "4 g salt if wine is unsalted", "oil to coat the pan"],
    "directions": ["Heat oil in the pan.", "Toss in the garlic, and the beef on top of that.", "Add the cumin. Brown the beef.", "Use the splash of wine to loosen anything stuck to the pan."],
    "notes": [],
    "tags": [],
    "created": "Sat Nov 2 21:45:31 2013 -0400",
    "author": "Aria Stewart <aredridel@nbtsc.org>"
  }],
  "condiments": [{
    "title": "Yogurt",
    "description": "Plain Balkan or Greek type yogurts add flavour and moisture. May be used as an alternative to sour cream. While sweet and fruit flavoured yogurts are not recommended, speciality yogurt dips such as jalapeno provide delicious variation.",
    "ingredients": ["Yogurt"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Thu Nov 28 15:22:11 2013 -0800",
    "author": "tamahoc <tamahoc@gmail.com>"
  }, {
    "title": "Vindaloo Sauce",
    "description": "Vindaloo is an Indian curry sauce that is popular in the Goa region of India. Vindaloo sauce can be prepared or store bought.",
    "ingredients": ["Vindaloo Sauce"],
    "directions": [],
    "notes": [],
    "tags": [],
    "created": "Sat Jul 12 23:40:03 2014 -0700",
    "author": "nick11robers <nick.roberts.127.0.0.1@gmail.com>"
  }, {
    "title": "Above Average Tomato Sauce",
    "description": "",
    "ingredients": ["1 24oz jar or can of crushed tomatos or tomato puree", "1 T olive oil", "1/4 to 1/2 of a medium onion", "2 cloves garlic", "1 red bell pepper", "1 t Italian seasoning", "salt to taste"],
    "directions": [],
    "notes": [],
    "tags": ["vegan", "vegetarian"],
    "created": "Tue Oct 7 20:49:25 2014 -0500",
    "author": "Geoff Hing <geoffhing@gmail.com>"
  }, {
    "title": "Spicy Mayo",
    "description": "",
    "ingredients": ["1/3 cup mayonnaise", "2 teaspoons gochujang paste"],
    "directions": ["Mix mayonnaise and gochujang together well. Let sit for 20 minutes so flavors can combine."],
    "notes": ["Gochujang paste can be found at asian markets."],
    "tags": ["vegetarian"],
    "created": "Wed Jul 20 12:49:54 2016 -0700",
    "author": "Erin Morrissey <erinmorrissey@gmail.com>"
  }, {
    "title": "Sour Cream",
    "description": "Cool and tart, sour cream is an almost-essential part of the traditional American taco, and many others as well.",
    "ingredients": ["Sour Cream"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Thu Nov 7 16:38:24 2013 -0500",
    "author": "Tim Murtaugh <tim.murtaugh@ogilvy.com>"
  }, {
    "title": "Simple Salsa Verde",
    "description": "I got this base recipe from a vegan friend. If you can't find one of these peppers, swap in another one!",
    "ingredients": ["6 Average-sized tomatillos", "1 Poblano pepper", "1 Serrano pepper", "1 Jalapeno pepper", "1 Sweet red pepper", "Juice of 1 or 2 fresh-squeezed limes (to taste)", "Pinch or two kosher salt (to taste)"],
    "directions": ["You're in charge of the heat here. For a milder salsa, remove all the ribs and seeds inside the peppers. For medium, leave in a few ribs, and for hot, go nuts. Rough chop the peppers and tomatillos, then throw into a blender or food processor with salt and lime juice. Pulse to desired consistency.", "As with most salsas, this will taste better if you let it sit in the fridge for a few hours before eating. It's great on chips or drizzled over steak or pork tacos."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Nov 2 21:15:17 2013 -0700",
    "author": "Ryan Pitts <ryan.a.pitts@gmail.com>"
  }, {
    "title": "Salsa Sauce",
    "description": "From What's Cookin' Cookbook: A Recipe Collection from the Schlaback Family",
    "ingredients": ["14 c. tomatoes, chopped", "2 1/2 c. onions", "4 tsp. fresh garlic", "2 (4 oz.) canned green chilies", "1 tsp. garlic powder", "1 tsp. salt", "2 tsp. paprika", "1/2 tsp. ground cumin", "1/4 tsp. oregano", "1 tsp. chili powder", "1/2 c. vinegar", "1 Tbsp. brown sugar"],
    "directions": ["Mix and bring to a boil.", "Cook down 1 1/2 hours.", "Cold pack for 20 minutes."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Nov 3 20:29:37 2013 -0600",
    "author": "Katherine Michel <kthrnmichel@gmail.com>"
  }, {
    "title": "Salsa de Aguacate",
    "description": "This is the traditional green sauce served from a Mexican taco cart. Very popular with Tacos al Pastór or Tacos de Canasta, it is a creamy, green sauce. It has avacado, but it by no means a guacamole. Usually available with other taco cart staples such as: sliced radishes, spicy salsa roja, fresh cilantro, and fresh limes.",
    "ingredients": ["1/2 Kilo of Green Tomatillos (~1lb.)", "2 green Serrano peppers (optional for heat)", "1 avocado", "2 limes", "1/2 cup crema (Mexican sour cream, thinner and sweeter than standard sour cream)"],
    "directions": ["Cook the tomatillos and peppers in a pot with water until soft. Drain the water out and let cool.", "Put tomatillos, peppers, salt, lime-juice, crema, and avacado (shelled and pitted) in blender. With lid on, blend until completely mixed and liquid consistency. Salsa should be the consistency of crema, liquid, yet slightly viscous.", "Pour over your tacos liberally. Refrigerate between uses."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Fri Nov 8 13:42:07 2013 -0800",
    "author": "Paul C Pederson <ppederson@esri.com>"
  }, {
    "title": "Roasted Tomatillo and Mushroom Sauce",
    "description": "A friend gave me this recipe a while back, but I can't remember who it was. Sorry, friend.",
    "ingredients": ["2 pounds tomatillos", "4 dried chipotle chiles", "2 pounds shiitake mushrooms", "1/4 cup olive oil", "1 cup water"],
    "directions": ["Remove husks from tomatillos and rinse them. Place them whole on your oven's broiler rack. Broil and turn them until they're browned on all sides.", "Boil the water. Drop in the dried chiles and bring the water down to a simmer. Keep them in until they are soft.", "Slice the shiitakes and cook them in a pan with the olive oil until they're tender.", "Take the chiles and tomatillos (once they're cooled off) and blend them in a food processor until they make a nice puree.", "Put the blended tomatillo-chile mixture in a saucepan and bring it to a boil. Add the cooked mushrooms and bring it back to a boil. Then bring the heat down until the mixture is simmering. Cook for about 10 minutes. Add salt to taste."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Nov 3 16:21:39 2013 -0600",
    "author": "Chris Cieslak <chris@electropuf.com>"
  }, {
    "title": "Pineapple Lime Crema",
    "description": "",
    "ingredients": ["1 5.3 ounce pineapple yogurt", "2 tablespoons mayonnaise", "1/2 tablespoon lime juice"],
    "directions": ["Whisk ingredients together in small bowl.", "Place in refrigerator until ready to use."],
    "notes": [],
    "tags": [],
    "created": "Mon Oct 3 15:50:55 2016 -0400",
    "author": "Lulu <lilulu004@gmail.com>"
  }, {
    "title": "Asian Pickled Vegetables",
    "description": "",
    "ingredients": ["1/4 cup rice vinegar", "2 teaspoons sugar", "1 teaspoon soy sauce", "1 teaspoon fish sauce", "Some red pepper flakes", "cucumbers", "carrots", "onions", "radishes"],
    "directions": ["Whisk ingredients in bowl.", "Toss in sliced vegetables.", "Mix, cover and chill in fridge for at least 30 minutes before using."],
    "notes": [],
    "tags": [],
    "created": "Sun Nov 3 11:58:34 2013 -0800",
    "author": "Karthik Ram <karthik.ram@gmail.com>"
  }, {
    "title": "Pickled Red Onions Variation",
    "description": "Pickled onions are a favorite in the Von Doom house, too. @littlewhirl played around with a similar starting point and we use this brine instead:",
    "ingredients": ["1/2 cup apple cider vinegar", "1 T Sugar (I usually use coconut palm sugar because I'm a hippie I guess)", "Water", "1 1/2 tsp salt", "1 sprig fresh oregano and/or cilantro (optional)"],
    "directions": ["Slice 1 red onion on a mandolin (WORTH IT).", "In a bowl melt the sugar and salt with some warm/hot water.", "Add vinegar and 1c of filtered water.", "Add in onion, top off w/ water so that the onion is just covered.", "VERY IMPORTANT: Let sit at room temp for at least an hour. Trust me."],
    "notes": ["The apple cider vinegar is a tangier but also more subtle, keeping more of the onion flavor there. And using a partial salt water brine lets it work nice for quick pickles, but also for slightly longer engagements. Leading to the most important aspect.", {
      "title": "PICKLE ALL THE THINGS",
      "notes": ["Seriously. All the things. Pickle your fridge. Pickle your waffles. Make. Lots. Of. Pickles.", "— red or green work. You only need an hour or so (like onions)", "— seriously GTFO these are good. Add dill for a twist. Add parboiled carrots if you want to cut the spice", "— because greenbeans are goddam delicious", "__Toy cars — kid with an attitude? Pickle their favorite toy car. Let's see them try to cop a tude when their matchbox cars are soggy and briney", "— personal favorite. Pickles in an hour, super delicious", "— baby corn is gross, but if you pickle it you can make jokes about how big all the other things you pickled are"]
    }],
    "tags": ["vegetarian", "vegan"],
    "created": "Mon May 15 22:44:52 2017 -0600",
    "author": "CJ R <cj@null.computer>"
  }, {
    "title": "Pickled Red Onions",
    "description": "My wife made this recipe up, after eating something similar, but if you are making brisket tacos, it is the most wonderful accessory.",
    "ingredients": ["Vinegar", "2 chopped red onions", "1 tablespoon of sugar", "a dash of chili powder"],
    "directions": ["Chop the red onions into rings and put them into a container of vinegar. Add the sugar and store the mixture in your refrigerator to marinate and pickle, the longer the better.", "Pick out the rings and place them on your brisket taco. Eat."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Nov 2 22:22:40 2013 -0400",
    "author": "Jeff Larson <thejefflarson@gmail.com>"
  }, {
    "title": "Pickled Jalapeños",
    "description": "",
    "ingredients": ["3/4 cup white vinegar", "3/4 cup water", "2 tablespoon sugar (optional)", "1 tablespoon kosher salt", "1/2 teaspoon oregano", "1 clove of garlic", "Dash of crushed red pepper (optional)", "8-10 sliced jalapeños"],
    "directions": ["Bring vinegar, water, sugar, salt, oregano, garlic, and red pepper to a boil in a saucepan", "Stir in sliced jalapeños, then remove from heat", "Cover saucepan and allow it to sit for 15-20 minutes", "Use tongs to put the jalapeños into a jar, then pour in the rest of the mixture until the jar is full", "Refrigerate for at least 30 minutes (preferably overnight)"],
    "notes": [],
    "tags": [],
    "created": "Wed Jun 29 01:51:37 2016 -0400",
    "author": "Nathaniel Brown <ngbrown11@gmail.com>"
  }, {
    "title": "Onions and Cilantro",
    "description": "",
    "ingredients": ["1 white onion, peeled.", "Bunch of cilantro, long bottom stems removed (stems between leaves are fine).", "Juice of one lime."],
    "directions": ["Dice white onion into 0.50 inch dice.", "Roughly chop cilantro.", "Add onion and cilantro to a bowl with the lime juice and mix thoroughly.", "Store in an airtight container for up to a week."],
    "notes": [],
    "tags": [],
    "created": "Tue Jul 8 12:30:24 2014 -0400",
    "author": "jeremyjbowers <jeremyjbowers@gmail.com>"
  }, {
    "title": "Mango Avocado Salsa",
    "description": "Goes great on soft shell chicken tacos with cheese (or deep-friend wantons with scallops)!",
    "ingredients": ["2 Avocados", "2 Mangos", "1 Orange", "1 Tablespoon Honey", "Garlic cloves (leave it up to your buds)", "Pepper", "1 Lime"],
    "directions": ["Chop avocado and mango into bowl.", "Squeeze the lime and half the orange in, add honey.", "Add garlic (chopped or pressed) and pepper to taste.", "Stir and enjoy!"],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Mon Nov 4 21:50:50 2013 -0500",
    "author": "Shane Shifflett <shifflett.shane@gmail.com>"
  }, {
    "title": "Mango Lime Salsa",
    "description": "This fresh mango salsa is sweet, tangy, and simple. It pairs exceedingly well with Garlic Lime Sauce for delicious fish tacos. The recipe is a simplified version of the mango salsa on Love and Oil.",
    "ingredients": ["2 ripe fresh mangoes, chopped", "1/2 cup diced sweet onion", "1-2 tablespoons chopped fresh cilantro", "Juice of 1 fresh lime", "(optional): 1/2 fresh jalapeno, diced"],
    "directions": ["Combine in a bowl.", "Stir and serve."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Mon Nov 11 14:28:58 2013 -0500",
    "author": "Javaun Moradi <jmoradi@npr.org>"
  }, {
    "title": "Mango Avocado Pico de Gallo",
    "description": "Excellent topping for fish or chicken tacos, or served just with chips.",
    "ingredients": ["1 c. small cubes of mango (about 1 medium to large RIPE mango - not too mushy, though)", "1 small avocado, cubed", "1/2-1 large jalapeno pepper (1/2 without seeds will give you a nice, mild-medium heat - add from there)", "1/4 c. chopped cilantro", "1/4 of a medium red onion, finely chopped", "Juice of 1 lime", "2-3 cloves garlic, minced", "Kosher or sea salt to taste", "Dash of chipotle pepper flakes or chipotle tabasco sauce if smoke is your thing"],
    "directions": ["Combine ingredients.", "Best served immediately, but will keep for a day."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Jan 4 15:10:47 2014 -0600",
    "author": "harknessa <a.j.harkness@gmail.com>"
  }, {
    "title": "Lime",
    "description": "",
    "ingredients": ["Lime"],
    "directions": ["Cut a lime into quarters or eights and squeeze juice onto any taco."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Mon Mar 17 19:06:06 2014 -0500",
    "author": "Sean Fitzpatrick <sffitzpatrick@gmail.com>"
  }, {
    "title": "Homemade Kimchi",
    "description": "Kimchi will take your taco in a decidedly unrestrained asian direction, but comfort zones were made to be broken. It takes some time to make, as fermentation needs to take place. It also may take some time to acquire a taste for it, but it's worth the effort.",
    "ingredients": ["1 napa cabbage", "1/2 cup kosher salt", "12 cups cold water (more if needed)", "8oz daikon radish, cut into matchstick-size strips.", "4 scallions, cut into 1-inch pieces", "1/3 cup Korean red pepper powder", "1/4 cup fish sauce", "1/4 cup minced fresh ginger", "1 tablespoon minced garlic", "2 teaspoons minced Korean salted shrimp", "1 1/2 teaspoons sugar"],
    "directions": ["Split the cabbage in half lengthwise, then crosswise into 2-inch pieces; discard the root. Put the cabbage into a large bowl with the salt and toss until the salt is evenly distributed. Add cold water to cover, making sure the cabbage is submerged. Cover with saran wrap and let it sit at room tempurature anywhere form 12-24 hours.", "Drain the cabbage and rinse in cold water. Gently squeeze to get as much liquid out as you cam, and set the cabbage aside in a smaller bowl.", "Add the remaining ingredients to the large bowl and mix it all up. Add the cabbage and toss until the cabbage is thoroughly covered.", "Pack it all into a 2 quart glass jar and close it up. Make sure you get a tight seal.", "Stick the jar in a dark place for about 24 hours. Open the lid to let out the gasses that have been wanting to get out, then close it up again and put it in the fridge.", "Wait two more days, and voila, you have kimchi. Some people sya that it's best to wait at least a week before eating; it will last about a month."],
    "notes": ["Lots of other vegetables can be added; play around with it.", "Thanks to Momofuku, we know that puréeing kimchi takes a lot of the sweater smell out of it, and creates a smoother and rounder flavor, and is fantastic for squeezing onto tacos."],
    "tags": [],
    "created": "Tue Nov 19 21:30:17 2013 -0500",
    "author": "Tim Murtaugh <tim.murtaugh@ogilvy.com>"
  }, {
    "title": "Guacamole (Simple)",
    "description": "If you're not in the mood to be fussy, this could be considered a minimum-viable guacamole recipe.",
    "ingredients": ["2 ripe avocados", "2-4 limes, depending on juiciness, delivering 2-4T of lime juice", "1 diced tomato (seeded if it's a big one)", "salt (to taste)", "hot sauce (to taste; Frank's Red Hot is a standard, but go with what you like)"],
    "directions": ["Scoop the avocado meat into a bowl and mash them with a fork. Leave it a bit lumpy as we will do more stirring in a bit and we don't want to over-work them.", "Add the chopped tomato.", "Add the lime juice; hold some back for later adjustment).", "Add ½t salt.", "Add 2T hot sauce.", "Stir with the fork again.", "Taste.", "Adjust salt/lime/hot sauce as desired."],
    "notes": ["This recipe will support one average-size bag of chips, so adjust quantities based on expectations."],
    "tags": ["vegetarian"],
    "created": "Thu Nov 7 16:38:24 2013 -0500",
    "author": "Tim Murtaugh <tim.murtaugh@ogilvy.com>"
  }, {
    "title": "Guacamole Boris Karloff",
    "description": "From the ubiquitous newspaper clipping, it's Karloff's recipe with sherry.",
    "ingredients": ["2 avocados", "1 med. tomato, chopped fine", "1 small onion, minced", "1 tbsp. chopped canned green chiles", "1 tbsp. lemon juice", "1 tsp sherry", "Dash cayenne, optional", "Salt, pepper"],
    "directions": ["Peel and mash avocados.", "Add onion, tomato and chiles, then stir in lemon juice, sherry and seasonings to taste, blending well.", "Serve as a dip for tortilla pieces or corn chips or as a canape spread.", "Makes 10 to 12 appetizer servings."],
    "notes": [],
    "tags": [],
    "created": "Mon May 15 22:44:52 2017 -0600",
    "author": "CJ R <cj@null.computer>"
  }, {
    "title": "Guacamole",
    "description": "This is pretty canonical stuff right here.\n\nThanks to The Awl for limited inspiration regarding the limey and drinky parts.",
    "ingredients": ["1-2 ripe Hass avocados", "half a lime", "a clove or two of chopped garlic", "some chopped white or yellow onion", "salt", "pepper", "dry cayenne or red chile pepper powder", "a jalapeño, if that's your thing", "a small chopped tomato", "a handful of chopped cilantro"],
    "directions": ["Look, here's how this works: First, you squeeze the lime juice into your nice little ceramic bowl. Then you add the garlic, onion, spices, peppers if you're heating it up, and then .", "Seriously, walk away for a minute. Crack open a nice Negra Modelo and use a wedge of the other half of the lime in it. Back in your bowl, let the strong stuff marinate in that lime juice for a few minutes. It's cooking.", "OK, now that you're back, mix in the rest of the non-avocado ingredients. If you have a pestle, now's it's time to shine. If not, use a small wooden spoon, or failing all else, a fork, you miserable lout.", "Mash up everything but the avocado. Get it pasty if you can. Squish it all up.", "Now you can add your avocado or two, dude. I usually go with about 1.5 avos to condiment tacos or taco-like structures for four humans of varying sizes.", "Just in case no one ever taught you how to deal with an avocado correctly, here's a quick lesson:", "To finish up your guacamole, mash your avocado up a bit and gently mix it into the magical citric-spice-tomato concoction. We're done here."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Tue Nov 5 11:33:23 2013 -0500",
    "author": "Ryan Sholin <ryansholin@gmail.com>"
  }, {
    "title": "Grilled Pineapple Pear Salsa",
    "description": "",
    "ingredients": ["1/2 ripe pineapple, trimmed and sliced", "1 large medium-firm pear sliced into 1/4 inch slices", "1 large red bell pepper, seeded and quartered", "1/2 small red onion, peeled and cut in half (so you have 2 quarters of a whole onion)", "1 jalapeno, diced", "1/2 cup loosely packed cilantro, finely chopped", "1 tablespoon lime juice", "1/8 teaspoon ground ginger", "1/8 teaspoon ground cumin", "salt and pepper to taste"],
    "directions": ["Sautee red onions, pineapple, red bell peppers, pears, and jalapeno in olive oil on high heat. Do not move vegetables and pineapples around until they're slightly charred and caramelized.", "Once the above ingredients are caramelized and charred, take them off the heat and place them in medium bowl.", "Mix in cilantro, lime juice, ground ginger, ground cumin, and salt and pepper.", "Can be eaten immediately but it is best served chilled."],
    "notes": [],
    "tags": [],
    "created": "Mon Oct 3 15:50:55 2016 -0400",
    "author": "Lulu <lilulu004@gmail.com>"
  }, {
    "title": "Garlic Lime Sauce",
    "description": "This sauce packs a creamy, sour, garlicky punch and can cut the heat on a spicy salsa. It pairs well with Mango Lime Salsa for excellent fish tacos. This is a simplified version of the lime sauce recipe on Love and Oil.",
    "ingredients": ["1-2 tablespoons mayonnaise", "1/2 cup plain yogurt", "2 tablespoons fresh lime juice", "1-2 cloves minced garlic", "salt to taste", "(optional): chopped fresh cilantro garnish"],
    "directions": ["Whisk ingredients together in bowl.", "Serve on the side, or drizzle as a decorative layer onto prepared tacos. Optionally sprinkle with chopped cilantro as garnish."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Mon Nov 11 16:45:51 2013 -0500",
    "author": "Javaun Moradi <jmoradi@npr.org>"
  }, {
    "title": "European Sour Cream",
    "description": "It is hard to find sour cream in Europe. This is a suitable alternative using more readily available ingredients.",
    "ingredients": ["1 cup crème fraîche", "juice of 1 lime", "pinch of salt"],
    "directions": ["Combine ingredients. Serve immediately or refrigerate."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Sun Mar 23 20:58:30 2014 +0100",
    "author": "yanofsky <github@yerit.com>"
  }, {
    "title": "Creamy Mustard Sauce",
    "description": "Originally a sauce used on sandwiches until one day I ran out of sour cream for my tacos. This recipe is meant to be \"eye-balled.\"",
    "ingredients": ["1/2 part Ranch dressing", "1/4 part Yellow Mustard", "1/4 part Grey Poupon Harvest Course Ground Mustard"],
    "directions": ["Mix all ingredients in container.", "Add to tacos, and anything else you'd like.", "Store in closed container in fridge."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Sun Sep 14 02:11:18 2014 -0400",
    "author": "JimVanG <jjvg@me.com>"
  }, {
    "title": "Cranberry Salsa",
    "description": "",
    "ingredients": ["1 bag cranberries", "1 cup water", "3/4 cup sugar", "half a small white onion (chopped)", "1 jalepeño, chopped small (remove seeds & wash for less heat)", "1 bunch cilantro (cut up)", "1 lime"],
    "directions": ["In a saucepan, get your water and sugar boiling, then add the cranberries. Boil until the cranberries pop (5-10 minutes), then take off heat, drain, and cool. They'll be slightly jelly-like, but you don't want them to disintegrate entirely, so watch them closely.", "While the cranberries are cooling, chop your white onion, your jalepeño and cilantro.", "Once your berries are cool, they'll probably have turned gooey. If there is still a bunch of water, drain it. But it's probably turned to jelly.", "Combine everything, and give a good squeeze of lime over the whole thing. As you combine, you'll notice that the cranberries just give up their shape entirely. Also: Don't wear your finest clothing when you do this--this shit .", {
      "title": "Make adjustments based on taste here. Your main variables are:",
      "directions": ["Sweet vs tangy. Default right now is tangy. Add more sugar for sweet.", "Battling the overwhelmingness of the cranberries. You've got two things going with the cranberries here: flavor and texture. More onion will add more crunch to the whole thing, and help boost up the salsa-ness. Jalepeño is your heat adjustment--seeds are your friend. But the Cilantro is your big mover here: it helps to round out the sharpness of the cranberry. Lime also helps bring down the cranberry overload."]
    }, {
      "title": "Orange Cranberry Salsa Holographic Varient Cover:",
      "directions": ["Go with half a cup of OJ and half a cup of water to boil your berries in.", "Compliment the lime juice with a fresh squeezed orange and then  that motherfucker right into the salsa"]
    }],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Mon Nov 18 17:59:07 2013 -0600",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "Chipotlé Sauce",
    "description": "",
    "ingredients": ["1 cup plain Greek yogurt", "Juice from 2 limes", "2-3 chipotlé peppers, with surrounding adobo sauce from can"],
    "directions": ["Drop all of this into a food processor, and blend away.", "Let sit in fridge for 30 minutes or overnight for flavor melding.", "Add to tacos, and anything else you'd like."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Sat Nov 2 22:05:27 2013 -0400",
    "author": "katemyers <kate.myers@gmail.com>"
  }, {
    "title": "Cilantro and Onion",
    "description": "Chop up some cilantro and onion (any variety) and put them on any taco.",
    "ingredients": ["Cilantro", "Onion"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Mon Mar 17 19:08:10 2014 -0500",
    "author": "Sean Fitzpatrick <sffitzpatrick@gmail.com>"
  }, {
    "title": "Chipotle Pineapple Sauce",
    "description": "",
    "ingredients": ["250 g chopped fresh pineapple", "1 minced onion", "15 ml olive oil", "2-3 chipotle peppers, with surrounding adobo sauce from can", "120 ml water"],
    "directions": ["Sautee the onion in the oil until translucent", "Add pineapple and let cook for just a couple minutes", "Add water and peppers and sauce and cook until reduced to just thinner than a paste"],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Mar 16 00:25:02 2014 -0400",
    "author": "Aria Stewart <aredridel@dinhe.net>"
  }, {
    "title": "Salsa de chile de árbol",
    "description": "This is a go-to taco sauce in western Mexico and probably elsewhere. You can\nmix and match the techniques in the two variants presented here, and substituting or adding chiles is a ramp onto the combinatorial superhighway of Mexican food and can demystify the salsa bar at the local taquería.",
    "ingredients": [{
      "title": "Red",
      "ingredients": ["dried whole", "tomatoes", "onion", ", garlic"]
    }, {
      "title": "Green",
      "ingredients": ["dried whole", "green tomatillos", "onion", "cilantro"]
    }],
    "directions": ["Red", "Green"],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Sun Nov 3 00:02:15 2013 -0700",
    "author": "Brian Mount <bvmount@gmail.com>"
  }, {
    "title": "Charred Corn",
    "description": "",
    "ingredients": ["6-8 ears of very fresh sweet corn.", "Canola, peanut or other high-heat vegetable oil.", "Sheet pan covered with tin foil.", "Good long tongs.", "Large metal bowl."],
    "directions": ["Prepare the oven for broiling by moving a single rack to the highest level. It should be no closer than 2-3 inches from the broiler.", "Under this rack set the second rack and the sheet pan covered with tin foil to catch drips from the corn.", "Brush each ear of corn lightly with oil.", "Pull out top rack halfway and place the corn directly on the rack.", "Push the rack in and turn on the broiler.", "Watch the corn. You're looking for some fairly blackened bits and lots of dark brown.", "Note: Do not let the corn catch on fire.", "Turn the corn one quarter turn with the tongs. Repeat until each corn ear is fairly dark brown.", "Remove the corn ears to the large metal bowl they are fully turned and browned/charred.", "Turn off the broiler.", "Let the corn cool for 15 minutes or until you can touch it.", "Stand an ear of corn up on the bottom.", "Using your sharpest knife, start at the top of the corn ear and slice down through the kernels. They will come off in sheets.", "Turn the corn a quarter or a fifth turn and repeat until you've removed the kernels. Note: Some will stick at the top and bottom.", "Do this for each ear of corn.", "Now you have a bowl full of kernels. Mix with lime juice (2 limes?) and 3-6 oz of cotija to make a corn salad.", "BONUS: Freeze the cobs. Later, make corn stock by boiling the cobs for an hour in 2 gallons of water. Remove the cobs and reduce to about 2 quarts. Use with grits or as a soup base."],
    "notes": [],
    "tags": [],
    "created": "Tue Jul 8 12:30:24 2014 -0400",
    "author": "jeremyjbowers <jeremyjbowers@gmail.com>"
  }, {
    "title": "Cashew Cheeze",
    "description": "This is a good dairy sub but also just pretty damn delicious.",
    "ingredients": ["1 cup raw organic cashews", "4 cups hot water", "1 small lemon, juiced and zested", "1/2 teaspoon salt (you can also play with other spices: garlic, cayenne, cumin etc. Go crazy!)", "2 tablespoons nutritional yeast", "1 roasted jalepeno (for spicy cheeze)"],
    "directions": ["In a large bowl add the raw cashews and hot water. Cover with a kitchen towel and allow to soak for 2-4 hours. Drain the cashews and rinse well.", "Add the soaked cashews, salt, nutritional yeast, jalepeno and the lemon juice in a blender or food processor. Blend on high and stir frequently scraping down the sides of the bowl. Keep processing the mixture until it is very smooth, and there are no lumps.", "Fold in the lemon zest (optional) and add to a serving bowl. You can also add a bit more water to get more of a creamy texture and store in a squeeze bottle (That's my preference anyway)."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Wed Nov 6 00:31:58 2013 -0500",
    "author": "OpenShift guest <taryn.mazza@gmail.com>"
  }, {
    "title": "Cabbage Slaw",
    "description": "",
    "ingredients": ["4 cups shredded green cabbage", "3 tablespoons apple cider vinegar", "3 tablespoons extra virgin olive oil", "2 tablespoons brown sugar", "Sea salt and freshly ground black pepper"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Wed Jul 20 12:49:54 2016 -0700",
    "author": "Erin Morrissey <erinmorrissey@gmail.com>"
  }, {
    "title": "Caramelized Pineapple",
    "description": "If you're making crock pot al pastor, make this too.",
    "ingredients": ["1/3 of a pineapple, peeled and chopped in 1/2 inch dice", "2 tablespoons reserved fat from   2 tablespoons neutral flavored oil such as canola, and 1/4 teaspoon chipotle powder."],
    "directions": ["If not using the pork fat, toss the pineapple with the chipotle powder.", "Heat the oil or fat in a pan over medium high heat. When it is hot, add the pineapple.", "Don't stir too much, let it get good and brown, this takes a few minutes. Watch to make sure the pineappled doesn't burn. Stir once or twice to brown a few different sides of the fruit.", "Serve warm."],
    "notes": [],
    "tags": [],
    "created": "Thu Mar 19 22:59:50 2015 -0400",
    "author": "bchartoff <bchartoff@gmail.com>"
  }, {
    "title": "Black Olives",
    "description": "Canned black olives add a sweet and cool meatiness to a traditional American taco.",
    "ingredients": ["Canned black olives"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Thu Nov 7 16:38:24 2013 -0500",
    "author": "Tim Murtaugh <tim.murtaugh@ogilvy.com>"
  }, {
    "title": "Beet Salsa",
    "description": "Tired of plain ol' Carne Asada Tacos? Get exotic with beet salsa.",
    "ingredients": ["4 - 6 Roma tomatoes", "1 - 2 Serrano pepper", "Reasonably sized onion (green or vidalia)", "10 garlic cloves (leave it up to your buds, I like 10 or more)", "Salt and pepper to taste", "1 bunch of beets", "1 or more lemons"],
    "directions": ["Fry tomatoes, pepper(s), onion and garlic in a pan until they are brown and tomato skins are peeling away.", "Move ingredients to the blender and purèe.", "Chop beets to a blendable size and add to salsa.", "Add salt and pepper to taste.", "Squeeze in desired amount of lemon and blend one more time."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Mon Nov 4 21:50:50 2013 -0500",
    "author": "Shane Shifflett <shifflett.shane@gmail.com>"
  }, {
    "title": "Avocado mango cilantro salsa",
    "description": "Recipe adapted from nom nom paleo.",
    "ingredients": ["2 cups diced ripe mango (about 2 mangos)", "½ cup finely diced red onion", "1 cup diced avocado (1 medium avocado)", "¼ cup minced fresh cilantro", "2 tablespoons extra virgin olive oil", "freshly ground black pepper", "big pinch of salt", "¼ teaspoon red pepper flakes", "Juice from 1 lime"],
    "directions": ["Combine ingredients in a bowl."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Wed Oct 5 20:53:06 2016 +0200",
    "author": "Madeleine Schönemann <madeleine.schonemann@tretton37.com>"
  }, {
    "title": "Baja White Sauce",
    "description": "This is a traditional white sauce for Baja fish tacos.",
    "ingredients": ["1/4 cup mayo", "2 tbsp sour cream", "1 tbsp lime juice", "1/4 tsp celery salt (or garlic salt, etc)"],
    "directions": ["Mix, and refrigerate for an hour if possible."],
    "notes": [],
    "tags": [],
    "created": "Mon Nov 4 10:16:58 2013 -0600",
    "author": "Kumar McMillan <kumar.mcmillan@gmail.com>"
  }, {
    "title": "Asian Cabbage Slaw",
    "description": "Add this to Asian Style Tacos for a taste sensation.",
    "ingredients": [{
      "title": "Dressing",
      "ingredients": ["1 lime, juiced", "2 Tbs Rice vinegar", "2 tsp sugar", "1 Tbs toasted sesame oil", "1 Tbs olive oil", "a squirt or two of sriracha", "pinch of salt"]
    }, {
      "title": "Slaw",
      "ingredients": ["1/2 head cabbage, chopped thin (slaw style)", "2 spring onions (scallions), chopped.", "some cilantro, chopped up, to taste"]
    }],
    "directions": ["Combine all the dressing ingredients in a big bowl, whirl them together until the sugar dissolves. Adjust the amount of sriracha in there to the heat you want your dressing to be.", "Toss the chopped cabbage, onions, and cilantro in with the dressing.", "Mix until everything is lightly dressed.", "YAY EVERYTHING."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Nov 17 14:20:41 2013 -0600",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "Phoning it in Pico de Gallo",
    "description": "",
    "ingredients": ["1 pint grape tomatoes, quartered (make your kids do this part)", "3 tablespoons finely chopped white onion", "Coarse salt", "Squeeze of lime", "As many finely chopped red (or green) jalapeños as you want (optional)"],
    "directions": ["Combine the tomatoes, cilantro and onion together in a bowl. Season to taste with salt and lime.", "Reserve some of this mixture for kids, and then add as much jalapeño as you like to the remaining mixture for the non wimps."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Nov 2 21:15:32 2013 -0700",
    "author": "littlewhirl <taryn.mazza@gmail.com>"
  }, {
    "title": "Roasted Tomato Salsa",
    "description": "",
    "ingredients": ["2 pounds roma tomatoes, cut in half lengthwise", "6 unpeeled garlic cloves", "1 large onion peeled, cut into slices", "1 jalapeno pepper, halved (remove inside if you would like it less spicy)", "1 handful fresh cilantro", "1 freshly-squeezed lime", "2 teaspoons salt", "", "", "", "Place tomatoes (skin side up), garlic, onion and jalapeno on cookie sheet and put in broiler for about 5 min. until skins start to blacken.", "Remove from broiler and let cool (refrigerate to cool quicker or if you like warm salsa continue on to step 4.)", "Place ALL ingredients into blender and blend until you have the consistancy you like.", "Serve and enjoy"],
    "directions": [],
    "notes": [],
    "tags": [],
    "created": "Mon May 15 22:44:52 2017 -0600",
    "author": "CJ R <cj@null.computer>"
  }],
  "mixins": [{
    "title": "Veggies for Fish Tacos",
    "description": "Fish tacos are a special breed, requiring different vegetable options.",
    "ingredients": ["Cabbage, purple, shredded", "Cabbage, other shades, shredded", "Radishes, sliced into thin slices", "Red peppers, diced", "Cherry tomatoes, sliced (if you're a heathen)", "Cilantro, if it doesn't taste like soap to you", "Limes, sliced for juicing over tacos."],
    "directions": ["Place out your selections and assemble into your taco. Then squeeze a lime over the top."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Nov 2 22:10:31 2013 -0400",
    "author": "katemyers <kate.myers@gmail.com>"
  }, {
    "title": "Traditional Taco Mixins",
    "description": "Makes about 20 servings.",
    "ingredients": ["1 (16 ounce) container sour cream", "1/4 head iceberg lettuce (rinsed, dried, shredded)", "1 cup shredded cheddar cheese", "3 diced tomatoes", "1 (2.25 ounce) can black olives, drained"],
    "directions": ["Add ingredients to tacos in layers."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Wed Nov 6 00:10:58 2013 -0600",
    "author": "Katherine Michel <kthrnmichel@gmail.com>"
  }, {
    "title": "Tomatoes (Traditional; US)",
    "description": "Adding a bit of coolness and moisture, tomatoes are a staple ingredient of the American taco. The better the tomato the more flavor they will impart, but even a sub-standard grocery store tomato has a place in a traditional taco.",
    "ingredients": ["Tomatoes (diced)", "Cherry Tomatoes (quartered)", "Grape Tomatoes (sliced)"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Wed Nov 6 17:58:26 2013 -0500",
    "author": "Tim Murtaugh <tim.murtaugh@ogilvy.com>"
  }, {
    "title": "Sweet Potato and Apple Hash",
    "description": "Sweet potatoes are my go-to taco punch-up. I was going my normal route of making small (1/4\" or so) cubes of sweet potatoes when I thought: Hey, it's fall, I'm going to add an apple in there. Fuck yes.",
    "ingredients": ["2 Small sweet potatoes (you'd be amazed how little sweet potato you need for tacos)", "1 Small apple", "One can diced green chilis", "A couple pinches of chili powder", "A squeeze of honey", "Pat o' butter"],
    "directions": ["Mix this all into a pan, with about 1/4 cup of water, and boil it all up until the water goes away, toss in the butter, and continue to pan-fry until things get a little browned."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Sat Nov 2 19:32:11 2013 -0500",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "Pomegranate Seeds",
    "description": "Technically called arils, pomegranate seeds are tasty little things. They pack a powerfully tart punch, and add some crunch to a taco that might need some textural assistance.\n\nYou want a pomegranate that feels heavy for its size and has a firm, tight skin. (Weight and firmness are indicators of how much juice is inside.)\n\nHere are two methods for getting the seeds out of the membrane.",
    "ingredients": ["Pomegranate"],
    "directions": ["The Water Method", "The Wooden Spoon Method"],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Wed Nov 20 14:07:18 2013 -0500",
    "author": "Tim Murtaugh <tim.murtaugh@ogilvy.com>"
  }, {
    "title": "Fajita-style peppers, onions, and mushrooms",
    "description": "Sauteed veggies that go great with almost any base layer.",
    "ingredients": ["2 bell peppers (any color)", "1/2 onion", "1 cup white mushrooms", "Oil (any kind)", "Salt", "Pepper", "Cumin", "Garlic powder", "Chili powder"],
    "directions": ["Dice onions, peppers, and mushrooms", "Heat oil in skillet", "Sautee onion until soft", "Add bell peppers; cook several minutes on medium heat", "Add mushrooms; cook until liquid is almost gone, stirring regularly", "Season to taste with spices"],
    "notes": [],
    "tags": [],
    "created": "Mon Apr 4 13:40:15 2016 -0400",
    "author": "reddigari <samirreddigari@gmail.com>"
  }, {
    "title": "Sauted Shitake Mushroom and Wasabi Salad",
    "description": "",
    "ingredients": ["1 cup dried shitake mushrooms", "Splash of soy sauce", "Splash of red wine vinegar", "Splash of olive oil", "Wasabi-covered sesame seeds (available at the local Asian mart. If you can't find it, sub just a smidge of wasabi)", "Pinch of salt"],
    "directions": ["Place shitakes in a bowl and cover with warm water. Soak for about 20 minutes or until shitakes are completely rehydrated. Remove mushrooms and squeeze excess water from them. They don't need to be completely dry, but shouldn't be sopping wet.", "Heat olive oil over medium-high heat in a small frying pan. Throw in soy sauce and red wine vinegar. How much depends on your taste. I would start with a tablespoon of each and adjust from there. I like the salad to be a bit more acidic so I tend to add a splash more of the red wine vinegar. Sauté mushrooms for a couple of minutes until they are heated through. Season to taste with salt. Adjust soy sauce and red wine vinegar as needed. Before serving, sprinkle a little bit of the wasabi-covered sesame seeds over the mushrooms to impart a little color, crunchiness, and heat. If you are unable to find wasabi-covered sesame seeds, a dab of wasabi and sprinkle of plain sesame seeds should do the trick."],
    "notes": ["I keep dried shitakes as a staple in my pantry. I love the fact that the water left over after you rehydrate the mushrooms is called mushroom liquor. Mushroom liquor can be used as a substitute for broth or water in many recipes to impart an lovely mushroomy flavor."],
    "tags": [],
    "created": "Tue Sep 9 23:12:40 2014 -0400",
    "author": "nowowl <c.d.lee82@gmail.com>"
  }, {
    "title": "Lettuce (Traditional; US)",
    "description": "In a traditional American taco, lettuce serves to add extra crunch and coolness. Favor the bulkier lettuces over leafier fare such as Bibb lettuces or mesclun.",
    "ingredients": ["Iceberg Lettuce (shredded)", "Romaine Lettuce (shredded; maintain the stalks)"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Wed Nov 6 17:58:26 2013 -0500",
    "author": "Tim Murtaugh <tim.murtaugh@ogilvy.com>"
  }, {
    "title": "Green Chile Cabbage Salad with Seared Corn",
    "description": "This isn't a tradition, or even particularly traditional -- except in my apartment in Oakland, where I make this for myself ever time I make pork tacos.",
    "ingredients": ["1 green cabbage", "4 limes", "2 ears corn, or roughly two cups of corn kernels (adjust to desired corn-y-ness)", "Dried, Powdered New Mexico Green Chile, to taste", "Salt, to taste", "Olive oil", "Optional: some crumbled cotija or queso Oaxaqueno"],
    "directions": ["If using ears of corn, strip the kernels from them with a sharp knife.", "Heat a few tablespoons of oil over high heat. I like to use a Dutch Oven for this, but the main cookware properties you want are heavy-bottomed and wide.", "Toss the corn kernels in to the oil, spread them evenly, salt very lightly and let them ride. I  recommend a splatter guard for this step, but  a lid. You want the corn to dry out just a little and get a good sear. It's done when it's starting to get dark, a little chewy, and probably is sticking to the pan.", "While the corn is going, core and chop the cabbage in to wide strips.", "How's the corn doing?", "Juice the limes.", "How's the corn doing? If it's not done yet, grab a beer and hang out 'til it is.", "The corn is done? Great. Toss it on top of the cabbage. Add a little salt, then a good hit of olive oil, then half-or-so of the lime juice. Toss in a good tablespoon or two of the green chile powder. Start stirring.", "You want everything coated nicely, but I don't like the salad too oily, so go easy on that. I add lime until the sour balances the sweet of the corn. I add green chile slowly -- it takes a second to rehydrate and get hot. I might add as much as a half cup of the stuff to a salad for myself or spicy food fans like me; I go easier on the spice-unenthused.", "Serve it! If you're in to tossing a little cheese on there, do it -- but I usually just eat it straight. Sometimes this goes on fish or chicken tacos; sometimes it's a side to richer pork tacos. It's always awesome."],
    "notes": ["green chile is the gastronomical life blood of New Mexican cuisine, but it's little known in the other 49 states. I like a brand called , which I can find sometimes in tiendas and other times at Whole Foods (go figure). The trick here is this: just don't accept substitutes. It's not the same. I've also had to accept that fresh chile is just not what this salad needs, so don't do that either (it doesn't distribute well enough across the cabbage). Do have this with cold, crisp beer."],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Nov 17 18:25:53 2013 -0800",
    "author": "Ross Donaldson <gastove@gmail.com>"
  }, {
    "title": "Drunken Green Beans",
    "description": "Green beans are fine. Green beans cooked in beer are better. Maybe even the best.",
    "ingredients": ["1 Surly fist full of green beans", "half a beer", "quarter cup vegetable broth", "2 cloves garlic", "1 Tbsp olive oil", "some salt, whatever"],
    "directions": ["First peel and dice the garlic and sauté it in the olive oil. Before it gets all burned and ruined, add the beer and vegetable broth.", "As the liquid comes to a boil, cut the green beans up. Add the green beans and a pinch of salt and let them simmer for about five minutes. If you like your beans on the softer side you can let it go a little longer. But the trick is to pull them right after the color starts to turn and you've just made a delicious addition to any taco."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Nov 2 18:23:29 2013 -0700",
    "author": "Jesse von Doom <jesse@cashmusic.org>"
  }, {
    "title": "Cheese (Traditional; US)",
    "description": "A major flavor component of a traditional American taco, select a cheese that's firm and sharp.",
    "ingredients": ["Cheddar (shredded)", "Jack/Pepper Jack (shredded)"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Wed Nov 6 17:58:26 2013 -0500",
    "author": "Tim Murtaugh <tim.murtaugh@ogilvy.com>"
  }, {
    "title": "Shredded Brussels Sprouts",
    "description": "A surprising, unexpected and delicious green addition to your taco!\n\nYou're not going to LOAD UP your taco with these, but they bring an amazing, mellow flavor to the mix. Especially good with fish tacos.",
    "ingredients": ["brussels sprouts", "butter"],
    "directions": ["Shred up your brussels sprouts so that they're flaked up. You're really going for almost a slaw-level shredding here.", "Put a healthy amount of butter in a pan, melt it down with a little salt too.", "Toss the shredded sprouts in, and fry 'em up until parts of them are browned up, and other parts have turned into a bright green. You're going for partial caramelization, but not all the way."],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Tue Mar 25 09:29:59 2014 -0500",
    "author": "sinker <dansinker@gmail.com>"
  }, {
    "title": "Potato Hash",
    "description": "",
    "ingredients": ["6 or so small yukon gold potatoes", "4 green onion, chopped", "1/2 small can of green chiles", "olive oil", "coarse salt", "1/4t chili powder", "dash cumin", "1/4t garlic powder", "Nutritional yeast (optional)"],
    "directions": ["Peel and dice potatoes, throw in a pan with a 1/4 or so of water, cover and cook on medium-high until potatoes are soft.", "Once potatoes are soft, lower to medium heat add green onions, chiles, spices and olive oil. Cook until hash-like. BOOM."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Mon Nov 4 23:12:50 2013 -0500",
    "author": "OpenShift guest <taryn.mazza@gmail.com>"
  }, {
    "title": "Corn Salad",
    "description": "",
    "ingredients": ["2 Ears of corn", "1 Lime, juiced", "Small handful of Cilantro, chopped", "A few green onions, chopped", "Garlic salt, or Garlic AND salt. I use Trader Joe's Garlic Salt in the grinder usually."],
    "directions": ["Cut the corn off of the cob, and in a mixing bowl mix together corn, lime juice, chopped cilantro and garlic salt. You can tweak any of this stuff as desired."],
    "notes": ["This is my first Github commit. I'm glad it's taco related."],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Nov 2 23:47:13 2013 -0400",
    "author": "OpenShift guest <taryn.mazza@gmail.com>"
  }],
  "seasonings": [{
    "title": "Sriracha Salt",
    "description": "I actually received this as a gift, but I found a recipe to make your own.\n\nThe effect on most food is as awesome as you'd expect but it is especially amazing with eggs. Add it to your breakfast tacos.",
    "ingredients": ["1 cup Salt", "10 tsp. Sriracha"],
    "directions": ["Mix the two ingredients together in a bowl.", "Spread it out on a baking sheet lined with foil or parchment paper.", "Put in a 200-degree oven, then turn the oven off and let it sit overnight inside. It will clump, but place in ziplock bag and attack it with a rolling pin. Tada!"],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Nov 2 23:20:01 2013 -0500",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "Sriracha Marinade",
    "description": "Alone on a Saturday night, I put on Iron Maiden, cubed up a pork chop and whipped this marinade together:",
    "ingredients": ["2-3 Tbs sriracha sauce", "couple pinches of Mexican Oregano", "good shake of smokey paprika", "tsp or so of ground ancho chile", "pinch of salt"],
    "directions": ["Get this coated nicely over everything before frying or grilling on high heat."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Mar 8 19:12:56 2014 -0600",
    "author": "sinker <dansinker@gmail.com>"
  }, {
    "title": "Quick and Dirty Spice Mix",
    "description": "I’m not going to make a lot of big assumptions here. You own a skillet of some sort. You have some jars of jankity-ass spices from who-knows-when. You want to eat some tacos within the next, like, fifteen minutes. I got you covered, bachelor(ette).",
    "ingredients": ["2 Tbsp all-purpose flour", "2 1/2 tsp. chili powder", "3/4 tsp. onion powder (or 1 1/2 tsp. minced yellow onion)", "1 1/4 tsp. salt", "1 tsp. paprika", "3/4 tsp beef bouillon powder", "1/4 tsp. granulated sugar", "1/4 tsp. cayenne pepper", "1/4 tsp. garlic powder", "1 tsp. cumin"],
    "directions": ["Put all this in something with a lid, add 3/4 cup of water, and shake it. Brown a pound of ground beef, then pour the whole situation in there. Stir. Cook it down until it looks like you only put in half a cup of water. You have tacos now."],
    "notes": ["I’ve made this with that soy protein “ground beef” and it does not  taste like someone put spices on a stack of cheap bar coasters and ran it all through a blender. (Vegetable) oil the skillet when you’re dealing with that stuff, unless you’re looking for excuses to buy a new one.", "If you leave out the bouillon for the sake of doing things vegan-style you’ll probably want to nudge up the salt a little."],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Nov 3 13:44:22 2013 -0500",
    "author": "Mat Marquis <mat@matmarquis.com>"
  }, {
    "title": "Packaged Seasonings",
    "description": "Lest we be accused of snobbery, let's acknowledge that a taco is a taco, and taco night can be well-served by not having to think at all.\n\nFeel free to use the pre-packaged seasoning of your choice. When I'm in an old-school mood, I head straight for...",
    "ingredients": ["Old El Paso Taco Seasoning"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Tue Nov 5 16:06:20 2013 -0500",
    "author": "Tim Murtaugh <tim@monkeydo.biz>"
  }, {
    "title": "Mahi Mahi Rub",
    "description": "A rub for Mahi Mahi, if fish tacos be what you're fancying. You choose your measurements and enjoy!",
    "ingredients": ["1 Part spicy chili powder", "1 Part salt", "1 Part ground cumin", "1/2 Part chopped cilantro", "1/2 Part cayenne", "1/2 Part pepper", "1/2 Part oregano", "1/2 Part onion powder", "1/2 Part garlic powder"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Nov 2 23:20:01 2013 -0500",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "Homemade Sriracha",
    "description": "Sure, Huy Fong's “rooster” brand sriracha is great, but wouldn't be nice to make your own? Now you can.\n\nA few tips before starting:\n\n\nDon't be a cowboy (or cowgirl)-use gloves. You are going to be handling a lot of peppers and the last thing you want to do is touch your eye or a more sensitive body part.\nHave good ventilation. Especially on the day you bring your chilis to a boil.\n",
    "ingredients": ["1 pound red jalepeño pepper, stemmed, seeded and halved.", "½ pound red serrano  pepper, stemmed, seeded and halved.", "¼ pound red thai chiles, stemmed, and halved.", "6 cloves garlic, peeled.", "1 tablespoon kosher salt.", "4 tablespoons palm sugar (light brown sugar can be substituted, see notes).", "½ cup cane vinegar (or rice wine vinegar, )."],
    "directions": ["Combine chilis, garlic, salt and sugar in food processor. Pulse to a coarse pureé.", "Transfer pureé to glass container. Store at room temperature for one week, stirring daily (see notes).", "After one week, transfer pureé to small saucepan, add vinegar and bring to boil.", "Reduce heat and simmer for five minutes. Allow to cool to room temperature.", "Transfer pureé to food processor and process for two to three minutes.", "Strain pureé through fine mesh strainer, using back of spoon or rubber spatula to press solids through strainer.", "Transfer finished sauce to glass jars and refrigerate. Can be stored for up to 6 months."],
    "notes": ["Any combination of red chile peppers will make a fine sriracha. Note thai chilis and serrano are hotter than jalepeños, so experiment with different combinations and find one that works for your taste.", "If you can't find palm sugar (usually found in most Asian markets) light brown sugar can be substituted. Light brown sugar is slightly sweeter so you may want to start with three tablespoons and adjust after tasting before step 3.", "Likewise, if you cannot find cane vinegar, rice wine vinegar can be substituted. Seasoned rice wine vinegar, commonly used in preparing sushi rice often has been sweetened, so keep that in mind if adjusting sweetener.", "Some recipes have suggested the pureé can be thick after the seven day fermentation and water can be used to thin the mixture when processing after the boiling/simmering stage.", "Finally, and  be sure to santize the glass jars/containers you use to ferment and store your sriracha. Just ask your favorite homebrewer what can happen if you do not properly sanitize your glass container before storing foodstuffs in them."],
    "tags": ["vegetarian", "vegan"],
    "created": "Wed Dec 11 00:42:50 2013 -0500",
    "author": "Michael Bishop <miklb@miklb.com>"
  }, {
    "title": "Chipotle Rub",
    "description": "Great rub/spice mix for shrimp, beef or pork.",
    "ingredients": ["1 teaspoon smoked paprika", "1/2 teaspoon curry powder", "1/4 teaspoon chipotle chile powder"],
    "directions": ["Stir to combine and apply to your protein of choice."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Wed Jul 20 12:49:54 2016 -0700",
    "author": "Erin Morrissey <erinmorrissey@gmail.com>"
  }, {
    "title": "Basic Dry Rub",
    "description": "This is a great, versatile recipe to use as a taco seasoning or as a dry rub for the protein of your choice. Equally at home in the skillet, oven, stovetop, or smoker.",
    "ingredients": ["2 Tbs Cumin", "2 Tbs Chili Powder", "1 Tbs Salt", "1 Tbs Garlic Powder", "2 tsp Black Pepper", "1 tsp Chipotle Powder"],
    "directions": ["Stir to combine and apply liberally."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Feb 9 10:20:32 2014 -0500",
    "author": "pmcg <patrickmcghen@gmail.com>"
  }, {
    "title": "Zaatar",
    "description": "A.k.a. za‘tar, za’atar, zattr, etc.\n\nZaatar is a thyme-based Middle Eastern seasoning that adapts well to tacos. It has a pleasantly dry, faintly sour/bitter flavor. It goes well on savory bases like squash and lamb, and combines with other sour seasonings like lemon juice and radish.\n\nThere are many kinds of zaatar, some quite different; this recipe is representative, not definitive.",
    "ingredients": ["4 units thyme", "2 units oregano", "2 units sesame seeds", "0–1 unit salt", "1 unit sumac (to be found at a Lebanese or Syrian market, or at a yuppie grocery; in a pinch, lemon zest can substitute)", "Other herbs to taste: fennel pollen, marjoram, cumin, etc.", "Optional: trace olive oil or lemon juice as a binder (but not if you plan to store it)"],
    "directions": ["Toast the sesame seeds. Grind all ingredients together using any method, stopping when the mixture is not too fine to pick up by pinching.", "May be added to meat during cooking, or sprinkled over a finished taco.", "The latest theories have not ruled out the possibility of a zaatar mole."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Sun Nov 3 00:25:34 2013 -0400",
    "author": "Charlie Loyd <celoyd@gmail.com>"
  }, {
    "title": "Universal Taco Seasoning",
    "description": "I got tired of buying packets of store-bought taco seasoning, so I experimented with various spices and ratios until I landed on this recipe. I keep a jar of it in the cupboard at all times.",
    "ingredients": ["6 tbsp chili powder", "4 tbsp cumin", "4 tbsp corn starch", "3 tbsp onion powder", "1 tbsp salt", "1 tbsp garlic powder", "4 tsp oregano (Mexican oregano, if you've got it)", "2 tsp crushed red pepper"],
    "directions": ["Combine in Mason jar and shake well to combine."],
    "notes": ["This mix works well for chicken, pork and beef, destined for the grill, oven, slow cooker or stovetop. You could tweak it a bit to target a specific meat, but I like to have a base, universal mix around. Makes it super easy to turn leftover anything into delicious taco filling: Just chop up whatever it is, toss it into a skillet, sprinkle generously with seasoning, then add a bit of water and simmer to impart flavor."],
    "tags": ["vegetarian", "vegan"],
    "created": "Sat Nov 2 20:44:09 2013 -0500",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }, {
    "title": "Kathy's Taco and Fajita Seasoning",
    "description": "My cousin Kathy sent me this recipe for my birthday:\n\nAmazing taco/fajita seasoning – Use with any protein.  It's a great recipe to quadruple so you have it ready for immediate taco needs. When making a big batch, use less salt.",
    "ingredients": ["2 tsp cumin", "1 tsp EACH: paprika, onion powder, dried oregano, and kosher salt", "½ tsp EACH: ground coriander, garlic powder and black pepper", "¼ tsp EACH: red pepper flakes, ground ginger and cayenne pepper"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Fri Nov 15 07:52:58 2013 -0600",
    "author": "Daniel Sinker <dansinker@gmail.com>"
  }],
  "shells": [{
    "title": "Perfect Flour Tortillas",
    "description": "This recipe is courtesy of Cynthia Detterick-Pineda at Whats Cooking America.\n\nYields: Approximate 15 tortillas\nPrep time: 15 min",
    "ingredients": ["3 cups all-purpose flour", "2 teaspoons baking powder", "1 teaspoon salt", "4 to 6 tablespoons lard or vegetable shortening", "1 1/4 cups warm water (approximate)"],
    "directions": ["If you follow the instructions provided, your tortillas will turn out perfectly - hence the name.", "Make sure to follow the handling methods and resting times closely. They can make or break the texture."],
    "notes": [],
    "tags": [],
    "created": "Sat Oct 10 20:58:54 2015 -0600",
    "author": "Shane Wright <kcshane@gmail.com>"
  }, {
    "title": "naan",
    "description": "Naan bread can be purchased or made. It is easier to buy it at a store.\n\nNaan bread is a flatbread that tends to be fluffy and easy to tear apart.",
    "ingredients": ["naan"],
    "directions": [],
    "notes": [],
    "tags": [],
    "created": "Sat Jul 12 23:27:41 2014 -0700",
    "author": "nick11robers <nick.roberts.127.0.0.1@gmail.com>"
  }, {
    "title": "Low Carb Tacos",
    "description": "For those who are on an Atkins or Low carb diet this is a recipe I found on you tube for a low carb taco shells using cheese.\n\n\nUse real cheese instead of the processed stuff.\n\n\nhttps://www.youtube.com/watch?v=6n019s5SCi4",
    "ingredients": ["Provolone Cheese Slices"],
    "directions": ["Take a round-sliced piece of provolone and place it on a plate.", "Microwave for 15-30 seconds", "Fold/form into a taco shape by hand."],
    "notes": [],
    "tags": [],
    "created": "Sun Aug 16 19:41:43 2015 -0600",
    "author": "Mosab Sasi <smosab@gmail.com>"
  }, {
    "title": "bad-ass tortillas",
    "description": "If you are making tacos, don't settle for corporate store bought tortillas. Make your own like a real person!",
    "ingredients": ["2 cups all purpose flour", "1/4 cup lard (cut into lil' pieces)", "1 teaspoon kosher salt", "2/3 tablespoon oil", "1/2 cup water (luke warm)"],
    "directions": ["First get a cast iron pan:", "Then one of these bad-ass tortilla presses:", "Buy your lard from a place like this:", "Mix all ingredients together except oil and water. Drizzle oil over mixture and mix with hands. Add water and mix and knead again until doughy. Let chill for about an hour in plastic wrappers.", "Heat large cast iron skillet (or something more authentic if you've got it) over medium heat. Cut dough into about 12 pieces that are round. Use a proper tortilla press (or something more authentic if you've got it) to make 'em flat and then put on the skillet. Wait until the transparent parts turn opaque and flip em. Put cooked tortillas in a  cloth napkin to keep 'em warm. End recipe. Paz, amor, y dinero."],
    "notes": [],
    "tags": [],
    "created": "Mon Dec 23 00:51:30 2013 -0500",
    "author": "Jeff Larson <thejefflarson@gmail.com>"
  }, {
    "title": "Hard Corn Shells (Traditional; US)",
    "description": "Mistakenly thought by many to be traditionally Mexican, hard shells were actually popularized in the US in the mid-20th century.\n\nWhile they can certainly be made at home (if you have access to a deep-fryer), the best method of obtaining hard taco shells is to head to the grocery store.\n\nIf you line them with a lettuce leaf rather than using chopped lettuce, when the shell cracks you won't lose the contents into your lap.",
    "ingredients": ["Hard Corn Shells"],
    "directions": [],
    "notes": [],
    "tags": ["vegetarian"],
    "created": "Wed Nov 6 18:17:22 2013 -0500",
    "author": "Tim Murtaugh <tim.murtaugh@ogilvy.com>"
  }, {
    "title": "Fresh Corn Tortillas",
    "description": "This is the only way to go. So worth it. Makes roughly 15 tortillas.",
    "ingredients": ["1 3/4 cups masa harina", "1 1/8 cups water"],
    "directions": ["In a medium bowl, mix together masa harina and hot water until thoroughly combined. Turn dough onto a clean surface and knead until pliable and smooth. If dough is too sticky, add more masa harina; if it begins to dry out, sprinkle with water. Cover dough tightly with plastic wrap and allow to stand for 30 minutes.", "Preheat a cast iron skillet or griddle to medium-high.", "Divide dough into 15 equal-size balls. Using a tortilla press (or a rolling pin), press each ball of dough flat between two sheets of wax paper (plastic wrap or a freezer bag cut into halves will also work).", "Place tortilla in preheated pan and allow to cook for approximately 30 seconds, or until browned and slightly puffy. Turn tortilla over to brown on second side for approximately 30 seconds more, then transfer to a plate. Repeat process with each ball of dough. Keep tortillas covered with a towel to stay warm and moist (or a low temp oven) until ready to serve."],
    "notes": [],
    "tags": ["vegetarian", "vegan"],
    "created": "Wed Nov 6 00:06:04 2013 -0500",
    "author": "OpenShift guest <taryn.mazza@gmail.com>"
  }]
}
